jbvalle/kx_regs/stm32f429zi_regs.h
/* Auto-generated from SVD: cmsis-svd-stm32/stm32f4/STM32F429.svd */
#ifndef STM32F429_H
#define STM32F429_H

#include <stdint.h>

typedef struct {
    volatile uint32_t CR          ; // 0x00 control register
    volatile uint32_t SR          ; // 0x04 status register
    volatile uint32_t DR          ; // 0x08 data register
} RNG_TypeDef;

#define RNG   ((RNG_TypeDef *) 0x50060800UL)

typedef struct {
    volatile uint32_t CR          ; // 0x00 control register
    volatile uint32_t DIN         ; // 0x04 data input register
    volatile uint32_t STR         ; // 0x08 start register
    volatile uint32_t HR0         ; // 0x0C digest registers
    volatile uint32_t HR1         ; // 0x10 digest registers
    volatile uint32_t HR2         ; // 0x14 digest registers
    volatile uint32_t HR3         ; // 0x18 digest registers
    volatile uint32_t HR4         ; // 0x1C digest registers
    volatile uint32_t IMR         ; // 0x20 interrupt enable register
    volatile uint32_t SR          ; // 0x24 status register
    volatile uint32_t RESERVED_0[52]; // 0x28 - 0xF7
    volatile uint32_t CSR0        ; // 0xF8 context swap registers
    volatile uint32_t CSR1        ; // 0xFC context swap registers
    volatile uint32_t CSR2        ; // 0x100 context swap registers
    volatile uint32_t CSR3        ; // 0x104 context swap registers
    volatile uint32_t CSR4        ; // 0x108 context swap registers
    volatile uint32_t CSR5        ; // 0x10C context swap registers
    volatile uint32_t CSR6        ; // 0x110 context swap registers
    volatile uint32_t CSR7        ; // 0x114 context swap registers
    volatile uint32_t CSR8        ; // 0x118 context swap registers
    volatile uint32_t CSR9        ; // 0x11C context swap registers
    volatile uint32_t CSR10       ; // 0x120 context swap registers
    volatile uint32_t CSR11       ; // 0x124 context swap registers
    volatile uint32_t CSR12       ; // 0x128 context swap registers
    volatile uint32_t CSR13       ; // 0x12C context swap registers
    volatile uint32_t CSR14       ; // 0x130 context swap registers
    volatile uint32_t CSR15       ; // 0x134 context swap registers
    volatile uint32_t CSR16       ; // 0x138 context swap registers
    volatile uint32_t CSR17       ; // 0x13C context swap registers
    volatile uint32_t CSR18       ; // 0x140 context swap registers
    volatile uint32_t CSR19       ; // 0x144 context swap registers
    volatile uint32_t CSR20       ; // 0x148 context swap registers
    volatile uint32_t CSR21       ; // 0x14C context swap registers
    volatile uint32_t CSR22       ; // 0x150 context swap registers
    volatile uint32_t CSR23       ; // 0x154 context swap registers
    volatile uint32_t CSR24       ; // 0x158 context swap registers
    volatile uint32_t CSR25       ; // 0x15C context swap registers
    volatile uint32_t CSR26       ; // 0x160 context swap registers
    volatile uint32_t CSR27       ; // 0x164 context swap registers
    volatile uint32_t CSR28       ; // 0x168 context swap registers
    volatile uint32_t CSR29       ; // 0x16C context swap registers
    volatile uint32_t CSR30       ; // 0x170 context swap registers
    volatile uint32_t CSR31       ; // 0x174 context swap registers
    volatile uint32_t CSR32       ; // 0x178 context swap registers
    volatile uint32_t CSR33       ; // 0x17C context swap registers
    volatile uint32_t CSR34       ; // 0x180 context swap registers
    volatile uint32_t CSR35       ; // 0x184 context swap registers
    volatile uint32_t CSR36       ; // 0x188 context swap registers
    volatile uint32_t CSR37       ; // 0x18C context swap registers
    volatile uint32_t CSR38       ; // 0x190 context swap registers
    volatile uint32_t CSR39       ; // 0x194 context swap registers
    volatile uint32_t CSR40       ; // 0x198 context swap registers
    volatile uint32_t CSR41       ; // 0x19C context swap registers
    volatile uint32_t CSR42       ; // 0x1A0 context swap registers
    volatile uint32_t CSR43       ; // 0x1A4 context swap registers
    volatile uint32_t CSR44       ; // 0x1A8 context swap registers
    volatile uint32_t CSR45       ; // 0x1AC context swap registers
    volatile uint32_t CSR46       ; // 0x1B0 context swap registers
    volatile uint32_t CSR47       ; // 0x1B4 context swap registers
    volatile uint32_t CSR48       ; // 0x1B8 context swap registers
    volatile uint32_t CSR49       ; // 0x1BC context swap registers
    volatile uint32_t CSR50       ; // 0x1C0 context swap registers
    volatile uint32_t CSR51       ; // 0x1C4 context swap registers
    volatile uint32_t CSR52       ; // 0x1C8 context swap registers
    volatile uint32_t CSR53       ; // 0x1CC context swap registers
    volatile uint32_t RESERVED_1[80]; // 0x1D0 - 0x30F
    volatile uint32_t HASH_HR0    ; // 0x310 HASH digest register
    volatile uint32_t HASH_HR1    ; // 0x314 read-only
    volatile uint32_t HASH_HR2    ; // 0x318 read-only
    volatile uint32_t HASH_HR3    ; // 0x31C read-only
    volatile uint32_t HASH_HR4    ; // 0x320 read-only
    volatile uint32_t HASH_HR5    ; // 0x324 read-only
    volatile uint32_t HASH_HR6    ; // 0x328 read-only
    volatile uint32_t HASH_HR7    ; // 0x32C read-only
} HASH_TypeDef;

#define HASH   ((HASH_TypeDef *) 0x50060400UL)

typedef struct {
    volatile uint32_t CR          ; // 0x00 control register
    volatile uint32_t SR          ; // 0x04 status register
    volatile uint32_t DIN         ; // 0x08 data input register
    volatile uint32_t DOUT        ; // 0x0C data output register
    volatile uint32_t DMACR       ; // 0x10 DMA control register
    volatile uint32_t IMSCR       ; // 0x14 interrupt mask set/clear register
    volatile uint32_t RISR        ; // 0x18 raw interrupt status register
    volatile uint32_t MISR        ; // 0x1C masked interrupt status register
    volatile uint32_t K0LR        ; // 0x20 key registers
    volatile uint32_t K0RR        ; // 0x24 key registers
    volatile uint32_t K1LR        ; // 0x28 key registers
    volatile uint32_t K1RR        ; // 0x2C key registers
    volatile uint32_t K2LR        ; // 0x30 key registers
    volatile uint32_t K2RR        ; // 0x34 key registers
    volatile uint32_t K3LR        ; // 0x38 key registers
    volatile uint32_t K3RR        ; // 0x3C key registers
    volatile uint32_t IV0LR       ; // 0x40 initialization vector registers
    volatile uint32_t IV0RR       ; // 0x44 initialization vector registers
    volatile uint32_t IV1LR       ; // 0x48 initialization vector registers
    volatile uint32_t IV1RR       ; // 0x4C initialization vector registers
    volatile uint32_t CSGCMCCM0R  ; // 0x50 context swap register
    volatile uint32_t CSGCMCCM1R  ; // 0x54 context swap register
    volatile uint32_t CSGCMCCM2R  ; // 0x58 context swap register
    volatile uint32_t CSGCMCCM3R  ; // 0x5C context swap register
    volatile uint32_t CSGCMCCM4R  ; // 0x60 context swap register
    volatile uint32_t CSGCMCCM5R  ; // 0x64 context swap register
    volatile uint32_t CSGCMCCM6R  ; // 0x68 context swap register
    volatile uint32_t CSGCMCCM7R  ; // 0x6C context swap register
    volatile uint32_t CSGCM0R     ; // 0x70 context swap register
    volatile uint32_t CSGCM1R     ; // 0x74 context swap register
    volatile uint32_t CSGCM2R     ; // 0x78 context swap register
    volatile uint32_t CSGCM3R     ; // 0x7C context swap register
    volatile uint32_t CSGCM4R     ; // 0x80 context swap register
    volatile uint32_t CSGCM5R     ; // 0x84 context swap register
    volatile uint32_t CSGCM6R     ; // 0x88 context swap register
    volatile uint32_t CSGCM7R     ; // 0x8C context swap register
} CRYP_TypeDef;

#define CRYP   ((CRYP_TypeDef *) 0x50060000UL)

