jbvalle/kx_regs/stm32f429zi_regs.h
typedef struct {
    volatile uint32_t CR          ; // 0x00 control register 1
    volatile uint32_t SR          ; // 0x04 status register
    volatile uint32_t RIS         ; // 0x08 raw interrupt status register
    volatile uint32_t IER         ; // 0x0C interrupt enable register
    volatile uint32_t MIS         ; // 0x10 masked interrupt status register
    volatile uint32_t ICR         ; // 0x14 interrupt clear register
    volatile uint32_t ESCR        ; // 0x18 embedded synchronization code register
    volatile uint32_t ESUR        ; // 0x1C embedded synchronization unmask register
    volatile uint32_t CWSTRT      ; // 0x20 crop window start
    volatile uint32_t CWSIZE      ; // 0x24 crop window size
    volatile uint32_t DR          ; // 0x28 data register
} DCMI_TypeDef;

#define DCMI   ((DCMI_TypeDef *) 0x50050000UL)

typedef struct {
    volatile uint32_t BCR1        ; // 0x00 SRAM/NOR-Flash chip-select control register 1
    volatile uint32_t BTR1        ; // 0x04 SRAM/NOR-Flash chip-select timing register 1
    volatile uint32_t BCR2        ; // 0x08 SRAM/NOR-Flash chip-select control register 2
    volatile uint32_t BTR2        ; // 0x0C SRAM/NOR-Flash chip-select timing register 2
    volatile uint32_t BCR3        ; // 0x10 SRAM/NOR-Flash chip-select control register 3
    volatile uint32_t BTR3        ; // 0x14 SRAM/NOR-Flash chip-select timing register 3
    volatile uint32_t BCR4        ; // 0x18 SRAM/NOR-Flash chip-select control register 4
    volatile uint32_t BTR4        ; // 0x1C SRAM/NOR-Flash chip-select timing register 4
    volatile uint32_t RESERVED_0[16]; // 0x20 - 0x5F
    volatile uint32_t PCR2        ; // 0x60 PC Card/NAND Flash control register 2
    volatile uint32_t SR2         ; // 0x64 FIFO status and interrupt register 2
    volatile uint32_t PMEM2       ; // 0x68 Common memory space timing register 2
    volatile uint32_t PATT2       ; // 0x6C Attribute memory space timing register 2
    volatile uint32_t RESERVED_1[1]; // 0x70 - 0x73
    volatile uint32_t ECCR2       ; // 0x74 ECC result register 2
    volatile uint32_t RESERVED_2[2]; // 0x78 - 0x7F
    volatile uint32_t PCR3        ; // 0x80 PC Card/NAND Flash control register 3
    volatile uint32_t SR3         ; // 0x84 FIFO status and interrupt register 3
    volatile uint32_t PMEM3       ; // 0x88 Common memory space timing register 3
    volatile uint32_t PATT3       ; // 0x8C Attribute memory space timing register 3
    volatile uint32_t RESERVED_3[1]; // 0x90 - 0x93
    volatile uint32_t ECCR3       ; // 0x94 ECC result register 3
    volatile uint32_t RESERVED_4[2]; // 0x98 - 0x9F
    volatile uint32_t PCR4        ; // 0xA0 PC Card/NAND Flash control register 4
    volatile uint32_t SR4         ; // 0xA4 FIFO status and interrupt register 4
    volatile uint32_t PMEM4       ; // 0xA8 Common memory space timing register 4
    volatile uint32_t PATT4       ; // 0xAC Attribute memory space timing register 4
    volatile uint32_t PIO4        ; // 0xB0 I/O space timing register 4
    volatile uint32_t RESERVED_5[20]; // 0xB4 - 0x103
    volatile uint32_t BWTR1       ; // 0x104 SRAM/NOR-Flash write timing registers 1
    volatile uint32_t BWTR3       ; // 0x104 SRAM/NOR-Flash write timing registers 3
    volatile uint32_t RESERVED_6[1]; // 0x108 - 0x10B
    volatile uint32_t BWTR2       ; // 0x10C SRAM/NOR-Flash write timing registers 2
    volatile uint32_t BWTR4       ; // 0x10C SRAM/NOR-Flash write timing registers 4
    volatile uint32_t RESERVED_7[12]; // 0x110 - 0x13F
    volatile uint32_t SDCR1       ; // 0x140 SDRAM Control Register 1
    volatile uint32_t SDCR2       ; // 0x144 SDRAM Control Register 2
    volatile uint32_t SDTR1       ; // 0x148 SDRAM Timing register 1
    volatile uint32_t SDTR2       ; // 0x14C SDRAM Timing register 2
    volatile uint32_t SDCMR       ; // 0x150 SDRAM Command Mode register
    volatile uint32_t SDRTR       ; // 0x154 SDRAM Refresh Timer register
    volatile uint32_t SDSR        ; // 0x158 SDRAM Status register
} FMC_TypeDef;

#define FMC   ((FMC_TypeDef *) 0xA0000000UL)

typedef struct {
    volatile uint32_t DBGMCU_IDCODE; // 0x00 IDCODE
    volatile uint32_t DBGMCU_CR   ; // 0x04 Control Register
    volatile uint32_t DBGMCU_APB1_FZ; // 0x08 Debug MCU APB1 Freeze registe
    volatile uint32_t DBGMCU_APB2_FZ; // 0x0C Debug MCU APB2 Freeze registe
} DBG_TypeDef;

#define DBG   ((DBG_TypeDef *) 0xE0042000UL)

typedef struct {
    volatile uint32_t LISR        ; // 0x00 low interrupt status register
    volatile uint32_t HISR        ; // 0x04 high interrupt status register
    volatile uint32_t LIFCR       ; // 0x08 low interrupt flag clear register
    volatile uint32_t HIFCR       ; // 0x0C high interrupt flag clear register
    volatile uint32_t S0CR        ; // 0x10 stream configuration register
    volatile uint32_t S0NDTR      ; // 0x14 stream number of data register
    volatile uint32_t S0PAR       ; // 0x18 stream peripheral address register
    volatile uint32_t S0M0AR      ; // 0x1C stream memory 0 address register
    volatile uint32_t S0M1AR      ; // 0x20 stream memory 1 address register
    volatile uint32_t S0FCR       ; // 0x24 stream FIFO control register
    volatile uint32_t S1CR        ; // 0x28 stream configuration register
    volatile uint32_t S1NDTR      ; // 0x2C stream number of data register
    volatile uint32_t S1PAR       ; // 0x30 stream peripheral address register
    volatile uint32_t S1M0AR      ; // 0x34 stream memory 0 address register
    volatile uint32_t S1M1AR      ; // 0x38 stream memory 1 address register
    volatile uint32_t S1FCR       ; // 0x3C stream FIFO control register
    volatile uint32_t S2CR        ; // 0x40 stream configuration register
    volatile uint32_t S2NDTR      ; // 0x44 stream number of data register
    volatile uint32_t S2PAR       ; // 0x48 stream peripheral address register
    volatile uint32_t S2M0AR      ; // 0x4C stream memory 0 address register
    volatile uint32_t S2M1AR      ; // 0x50 stream memory 1 address register
    volatile uint32_t S2FCR       ; // 0x54 stream FIFO control register
    volatile uint32_t S3CR        ; // 0x58 stream configuration register
    volatile uint32_t S3NDTR      ; // 0x5C stream number of data register
    volatile uint32_t S3PAR       ; // 0x60 stream peripheral address register
    volatile uint32_t S3M0AR      ; // 0x64 stream memory 0 address register
    volatile uint32_t S3M1AR      ; // 0x68 stream memory 1 address register
    volatile uint32_t S3FCR       ; // 0x6C stream FIFO control register
    volatile uint32_t S4CR        ; // 0x70 stream configuration register
    volatile uint32_t S4NDTR      ; // 0x74 stream number of data register
    volatile uint32_t S4PAR       ; // 0x78 stream peripheral address register
    volatile uint32_t S4M0AR      ; // 0x7C stream memory 0 address register
    volatile uint32_t S4M1AR      ; // 0x80 stream memory 1 address register
    volatile uint32_t S4FCR       ; // 0x84 stream FIFO control register
    volatile uint32_t S5CR        ; // 0x88 stream configuration register
    volatile uint32_t S5NDTR      ; // 0x8C stream number of data register
    volatile uint32_t S5PAR       ; // 0x90 stream peripheral address register
    volatile uint32_t S5M0AR      ; // 0x94 stream memory 0 address register
    volatile uint32_t S5M1AR      ; // 0x98 stream memory 1 address register
    volatile uint32_t S5FCR       ; // 0x9C stream FIFO control register
    volatile uint32_t S6CR        ; // 0xA0 stream configuration register
    volatile uint32_t S6NDTR      ; // 0xA4 stream number of data register
    volatile uint32_t S6PAR       ; // 0xA8 stream peripheral address register
    volatile uint32_t S6M0AR      ; // 0xAC stream memory 0 address register
    volatile uint32_t S6M1AR      ; // 0xB0 stream memory 1 address register
    volatile uint32_t S6FCR       ; // 0xB4 stream FIFO control register
    volatile uint32_t S7CR        ; // 0xB8 stream configuration register
    volatile uint32_t S7NDTR      ; // 0xBC stream number of data register
    volatile uint32_t S7PAR       ; // 0xC0 stream peripheral address register
    volatile uint32_t S7M0AR      ; // 0xC4 stream memory 0 address register
    volatile uint32_t S7M1AR      ; // 0xC8 stream memory 1 address register
    volatile uint32_t S7FCR       ; // 0xCC stream FIFO control register
} DMA2_TypeDef;

#define DMA2   ((DMA2_TypeDef *) 0x40026400UL)

