jbvalle/kx_regs/stm32f429zi_regs.h
typedef struct {
    volatile uint32_t CR          ; // 0x00 clock control register
    volatile uint32_t PLLCFGR     ; // 0x04 PLL configuration register
    volatile uint32_t CFGR        ; // 0x08 clock configuration register
    volatile uint32_t CIR         ; // 0x0C clock interrupt register
    volatile uint32_t AHB1RSTR    ; // 0x10 AHB1 peripheral reset register
    volatile uint32_t AHB2RSTR    ; // 0x14 AHB2 peripheral reset register
    volatile uint32_t AHB3RSTR    ; // 0x18 AHB3 peripheral reset register
    volatile uint32_t RESERVED_0[1]; // 0x1C - 0x1F
    volatile uint32_t APB1RSTR    ; // 0x20 APB1 peripheral reset register
    volatile uint32_t APB2RSTR    ; // 0x24 APB2 peripheral reset register
    volatile uint32_t RESERVED_1[2]; // 0x28 - 0x2F
    volatile uint32_t AHB1ENR     ; // 0x30 AHB1 peripheral clock register
    volatile uint32_t AHB2ENR     ; // 0x34 AHB2 peripheral clock enable register
    volatile uint32_t AHB3ENR     ; // 0x38 AHB3 peripheral clock enable register
    volatile uint32_t RESERVED_2[1]; // 0x3C - 0x3F
    volatile uint32_t APB1ENR     ; // 0x40 APB1 peripheral clock enable register
    volatile uint32_t APB2ENR     ; // 0x44 APB2 peripheral clock enable register
    volatile uint32_t RESERVED_3[2]; // 0x48 - 0x4F
    volatile uint32_t AHB1LPENR   ; // 0x50 AHB1 peripheral clock enable in low power mode register
    volatile uint32_t AHB2LPENR   ; // 0x54 AHB2 peripheral clock enable in low power mode register
    volatile uint32_t AHB3LPENR   ; // 0x58 AHB3 peripheral clock enable in low power mode register
    volatile uint32_t RESERVED_4[1]; // 0x5C - 0x5F
    volatile uint32_t APB1LPENR   ; // 0x60 APB1 peripheral clock enable in low power mode register
    volatile uint32_t APB2LPENR   ; // 0x64 APB2 peripheral clock enabled in low power mode register
    volatile uint32_t RESERVED_5[2]; // 0x68 - 0x6F
    volatile uint32_t BDCR        ; // 0x70 Backup domain control register
    volatile uint32_t CSR         ; // 0x74 clock control & status register
    volatile uint32_t RESERVED_6[2]; // 0x78 - 0x7F
    volatile uint32_t SSCGR       ; // 0x80 spread spectrum clock generation register
    volatile uint32_t PLLI2SCFGR  ; // 0x84 PLLI2S configuration register
    volatile uint32_t PLLSAICFGR  ; // 0x88 RCC PLL configuration register
    volatile uint32_t DCKCFGR     ; // 0x8C RCC Dedicated Clock Configuration Register
} RCC_TypeDef;

#define RCC   ((RCC_TypeDef *) 0x40023800UL)

typedef struct {
    volatile uint32_t MODER       ; // 0x00 GPIO port mode register
    volatile uint32_t OTYPER      ; // 0x04 GPIO port output type register
    volatile uint32_t OSPEEDR     ; // 0x08 GPIO port output speed register
    volatile uint32_t PUPDR       ; // 0x0C GPIO port pull-up/pull-down register
    volatile uint32_t IDR         ; // 0x10 GPIO port input data register
    volatile uint32_t ODR         ; // 0x14 GPIO port output data register
    volatile uint32_t BSRR        ; // 0x18 GPIO port bit set/reset register
    volatile uint32_t LCKR        ; // 0x1C GPIO port configuration lock register
    volatile uint32_t AFRL        ; // 0x20 GPIO alternate function low register
    volatile uint32_t AFRH        ; // 0x24 GPIO alternate function high register
} GPIOK_TypeDef;

#define GPIOK   ((GPIOK_TypeDef *) 0x40022800UL)

typedef struct {
    volatile uint32_t MODER       ; // 0x00 GPIO port mode register
    volatile uint32_t OTYPER      ; // 0x04 GPIO port output type register
    volatile uint32_t OSPEEDR     ; // 0x08 GPIO port output speed register
    volatile uint32_t PUPDR       ; // 0x0C GPIO port pull-up/pull-down register
    volatile uint32_t IDR         ; // 0x10 GPIO port input data register
    volatile uint32_t ODR         ; // 0x14 GPIO port output data register
    volatile uint32_t BSRR        ; // 0x18 GPIO port bit set/reset register
    volatile uint32_t LCKR        ; // 0x1C GPIO port configuration lock register
    volatile uint32_t AFRL        ; // 0x20 GPIO alternate function low register
    volatile uint32_t AFRH        ; // 0x24 GPIO alternate function high register
} GPIOB_TypeDef;

#define GPIOB   ((GPIOB_TypeDef *) 0x40020400UL)

typedef struct {
    volatile uint32_t MODER       ; // 0x00 GPIO port mode register
    volatile uint32_t OTYPER      ; // 0x04 GPIO port output type register
    volatile uint32_t OSPEEDR     ; // 0x08 GPIO port output speed register
    volatile uint32_t PUPDR       ; // 0x0C GPIO port pull-up/pull-down register
    volatile uint32_t IDR         ; // 0x10 GPIO port input data register
    volatile uint32_t ODR         ; // 0x14 GPIO port output data register
    volatile uint32_t BSRR        ; // 0x18 GPIO port bit set/reset register
    volatile uint32_t LCKR        ; // 0x1C GPIO port configuration lock register
    volatile uint32_t AFRL        ; // 0x20 GPIO alternate function low register
    volatile uint32_t AFRH        ; // 0x24 GPIO alternate function high register
} GPIOA_TypeDef;

#define GPIOA   ((GPIOA_TypeDef *) 0x40020000UL)

typedef struct {
    volatile uint32_t MEMRM       ; // 0x00 memory remap register
    volatile uint32_t PMC         ; // 0x04 peripheral mode configuration register
    volatile uint32_t EXTICR1     ; // 0x08 external interrupt configuration register 1
    volatile uint32_t EXTICR2     ; // 0x0C external interrupt configuration register 2
    volatile uint32_t EXTICR3     ; // 0x10 external interrupt configuration register 3
    volatile uint32_t EXTICR4     ; // 0x14 external interrupt configuration register 4
    volatile uint32_t RESERVED_0[2]; // 0x18 - 0x1F
    volatile uint32_t CMPCR       ; // 0x20 Compensation cell control register
} SYSCFG_TypeDef;

#define SYSCFG   ((SYSCFG_TypeDef *) 0x40013800UL)

typedef struct {
    volatile uint32_t CR1         ; // 0x00 control register 1
    volatile uint32_t CR2         ; // 0x04 control register 2
    volatile uint32_t SR          ; // 0x08 status register
    volatile uint32_t DR          ; // 0x0C data register
    volatile uint32_t CRCPR       ; // 0x10 CRC polynomial register
    volatile uint32_t RXCRCR      ; // 0x14 RX CRC register
    volatile uint32_t TXCRCR      ; // 0x18 TX CRC register
    volatile uint32_t I2SCFGR     ; // 0x1C I2S configuration register
    volatile uint32_t I2SPR       ; // 0x20 I2S prescaler register
} SPI1_TypeDef;

#define SPI1   ((SPI1_TypeDef *) 0x40013000UL)

