jbvalle/kx_regs/stm32f429zi_regs.h
typedef struct {
    volatile uint32_t POWER       ; // 0x00 power control register
    volatile uint32_t CLKCR       ; // 0x04 SDI clock control register
    volatile uint32_t ARG         ; // 0x08 argument register
    volatile uint32_t CMD         ; // 0x0C command register
    volatile uint32_t RESPCMD     ; // 0x10 command response register
    volatile uint32_t RESP1       ; // 0x14 response 1..4 register
    volatile uint32_t RESP2       ; // 0x18 response 1..4 register
    volatile uint32_t RESP3       ; // 0x1C response 1..4 register
    volatile uint32_t RESP4       ; // 0x20 response 1..4 register
    volatile uint32_t DTIMER      ; // 0x24 data timer register
    volatile uint32_t DLEN        ; // 0x28 data length register
    volatile uint32_t DCTRL       ; // 0x2C data control register
    volatile uint32_t DCOUNT      ; // 0x30 data counter register
    volatile uint32_t STA         ; // 0x34 status register
    volatile uint32_t ICR         ; // 0x38 interrupt clear register
    volatile uint32_t MASK        ; // 0x3C mask register
    volatile uint32_t RESERVED_0[2]; // 0x40 - 0x47
    volatile uint32_t FIFOCNT     ; // 0x48 FIFO counter register
    volatile uint32_t RESERVED_1[13]; // 0x4C - 0x7F
    volatile uint32_t FIFO        ; // 0x80 data FIFO register
} SDIO_TypeDef;

#define SDIO   ((SDIO_TypeDef *) 0x40012C00UL)

typedef struct {
    volatile uint32_t SR          ; // 0x00 status register
    volatile uint32_t CR1         ; // 0x04 control register 1
    volatile uint32_t CR2         ; // 0x08 control register 2
    volatile uint32_t SMPR1       ; // 0x0C sample time register 1
    volatile uint32_t SMPR2       ; // 0x10 sample time register 2
    volatile uint32_t JOFR1       ; // 0x14 injected channel data offset register
    volatile uint32_t JOFR2       ; // 0x18 injected channel data offset register
    volatile uint32_t JOFR3       ; // 0x1C injected channel data offset register
    volatile uint32_t JOFR4       ; // 0x20 injected channel data offset register
    volatile uint32_t HTR         ; // 0x24 watchdog higher threshold register
    volatile uint32_t LTR         ; // 0x28 watchdog lower threshold register
    volatile uint32_t SQR1        ; // 0x2C regular sequence register 1
    volatile uint32_t SQR2        ; // 0x30 regular sequence register 2
    volatile uint32_t SQR3        ; // 0x34 regular sequence register 3
    volatile uint32_t JSQR        ; // 0x38 injected sequence register
    volatile uint32_t JDR1        ; // 0x3C injected data register
    volatile uint32_t JDR2        ; // 0x40 injected data register
    volatile uint32_t JDR3        ; // 0x44 injected data register
    volatile uint32_t JDR4        ; // 0x48 injected data register
    volatile uint32_t DR          ; // 0x4C regular data register
} ADC1_TypeDef;

#define ADC1   ((ADC1_TypeDef *) 0x40012000UL)

typedef struct {
    volatile uint32_t SR          ; // 0x00 Status register
    volatile uint32_t DR          ; // 0x04 Data register
    volatile uint32_t BRR         ; // 0x08 Baud rate register
    volatile uint32_t CR1         ; // 0x0C Control register 1
    volatile uint32_t CR2         ; // 0x10 Control register 2
    volatile uint32_t CR3         ; // 0x14 Control register 3
    volatile uint32_t GTPR        ; // 0x18 Guard time and prescaler register
} USART6_TypeDef;

#define USART6   ((USART6_TypeDef *) 0x40011400UL)

typedef struct {
    volatile uint32_t CR          ; // 0x00 control register
    volatile uint32_t SWTRIGR     ; // 0x04 software trigger register
    volatile uint32_t DHR12R1     ; // 0x08 channel1 12-bit right-aligned data holding register
    volatile uint32_t DHR12L1     ; // 0x0C channel1 12-bit left aligned data holding register
    volatile uint32_t DHR8R1      ; // 0x10 channel1 8-bit right aligned data holding register
    volatile uint32_t DHR12R2     ; // 0x14 channel2 12-bit right aligned data holding register
    volatile uint32_t DHR12L2     ; // 0x18 channel2 12-bit left aligned data holding register
    volatile uint32_t DHR8R2      ; // 0x1C channel2 8-bit right-aligned data holding register
    volatile uint32_t DHR12RD     ; // 0x20 Dual DAC 12-bit right-aligned data holding register
    volatile uint32_t DHR12LD     ; // 0x24 DUAL DAC 12-bit left aligned data holding register
    volatile uint32_t DHR8RD      ; // 0x28 DUAL DAC 8-bit right aligned data holding register
    volatile uint32_t DOR1        ; // 0x2C channel1 data output register
    volatile uint32_t DOR2        ; // 0x30 channel2 data output register
    volatile uint32_t SR          ; // 0x34 status register
} DAC_TypeDef;

#define DAC   ((DAC_TypeDef *) 0x40007400UL)

typedef struct {
    volatile uint32_t CR          ; // 0x00 power control register
    volatile uint32_t CSR         ; // 0x04 power control/status register
} PWR_TypeDef;

#define PWR   ((PWR_TypeDef *) 0x40007000UL)

typedef struct {
    volatile uint32_t KR          ; // 0x00 Key register
    volatile uint32_t PR          ; // 0x04 Prescaler register
    volatile uint32_t RLR         ; // 0x08 Reload register
    volatile uint32_t SR          ; // 0x0C Status register
} IWDG_TypeDef;

#define IWDG   ((IWDG_TypeDef *) 0x40003000UL)

typedef struct {
    volatile uint32_t CR          ; // 0x00 Control register
    volatile uint32_t CFR         ; // 0x04 Configuration register
    volatile uint32_t SR          ; // 0x08 Status register
} WWDG_TypeDef;

#define WWDG   ((WWDG_TypeDef *) 0x40002C00UL)

typedef struct {
    volatile uint32_t TR          ; // 0x00 time register
    volatile uint32_t DR          ; // 0x04 date register
    volatile uint32_t CR          ; // 0x08 control register
    volatile uint32_t ISR         ; // 0x0C initialization and status register
    volatile uint32_t PRER        ; // 0x10 prescaler register
    volatile uint32_t WUTR        ; // 0x14 wakeup timer register
    volatile uint32_t CALIBR      ; // 0x18 calibration register
    volatile uint32_t ALRMAR      ; // 0x1C alarm A register
    volatile uint32_t ALRMBR      ; // 0x20 alarm B register
    volatile uint32_t WPR         ; // 0x24 write protection register
    volatile uint32_t SSR         ; // 0x28 sub second register
    volatile uint32_t SHIFTR      ; // 0x2C shift control register
    volatile uint32_t TSTR        ; // 0x30 time stamp time register
    volatile uint32_t TSDR        ; // 0x34 time stamp date register
    volatile uint32_t TSSSR       ; // 0x38 timestamp sub second register
    volatile uint32_t CALR        ; // 0x3C calibration register
    volatile uint32_t TAFCR       ; // 0x40 tamper and alternate function configuration register
    volatile uint32_t ALRMASSR    ; // 0x44 alarm A sub second register
    volatile uint32_t ALRMBSSR    ; // 0x48 alarm B sub second register
    volatile uint32_t RESERVED_0[1]; // 0x4C - 0x4F
    volatile uint32_t BKP0R       ; // 0x50 backup register
    volatile uint32_t BKP1R       ; // 0x54 backup register
    volatile uint32_t BKP2R       ; // 0x58 backup register
    volatile uint32_t BKP3R       ; // 0x5C backup register
    volatile uint32_t BKP4R       ; // 0x60 backup register
    volatile uint32_t BKP5R       ; // 0x64 backup register
    volatile uint32_t BKP6R       ; // 0x68 backup register
    volatile uint32_t BKP7R       ; // 0x6C backup register
    volatile uint32_t BKP8R       ; // 0x70 backup register
    volatile uint32_t BKP9R       ; // 0x74 backup register
    volatile uint32_t BKP10R      ; // 0x78 backup register
    volatile uint32_t BKP11R      ; // 0x7C backup register
    volatile uint32_t BKP12R      ; // 0x80 backup register
    volatile uint32_t BKP13R      ; // 0x84 backup register
    volatile uint32_t BKP14R      ; // 0x88 backup register
    volatile uint32_t BKP15R      ; // 0x8C backup register
    volatile uint32_t BKP16R      ; // 0x90 backup register
    volatile uint32_t BKP17R      ; // 0x94 backup register
    volatile uint32_t BKP18R      ; // 0x98 backup register
    volatile uint32_t BKP19R      ; // 0x9C backup register
} RTC_TypeDef;

#define RTC   ((RTC_TypeDef *) 0x40002800UL)

