jbvalle/kx_regs/stm32f429zi_regs.h
typedef struct {
    volatile uint32_t SR          ; // 0x00 Status register
    volatile uint32_t DR          ; // 0x04 Data register
    volatile uint32_t BRR         ; // 0x08 Baud rate register
    volatile uint32_t CR1         ; // 0x0C Control register 1
    volatile uint32_t CR2         ; // 0x10 Control register 2
    volatile uint32_t CR3         ; // 0x14 Control register 3
} UART4_TypeDef;

#define UART4   ((UART4_TypeDef *) 0x40004C00UL)

typedef struct {
    volatile uint32_t CSR         ; // 0x00 ADC Common status register
    volatile uint32_t CCR         ; // 0x04 ADC common control register
    volatile uint32_t CDR         ; // 0x08 ADC common regular data register for dual and triple modes
} C_ADC_TypeDef;

#define C_ADC   ((C_ADC_TypeDef *) 0x40012300UL)

typedef struct {
    volatile uint32_t CR1         ; // 0x00 control register 1
    volatile uint32_t CR2         ; // 0x04 control register 2
    volatile uint32_t SMCR        ; // 0x08 slave mode control register
    volatile uint32_t DIER        ; // 0x0C DMA/Interrupt enable register
    volatile uint32_t SR          ; // 0x10 status register
    volatile uint32_t EGR         ; // 0x14 event generation register
    volatile uint32_t CCMR1_Output; // 0x18 capture/compare mode register 1 (output mode)
    volatile uint32_t CCMR1_Input ; // 0x18 capture/compare mode register 1 (input mode)
    volatile uint32_t CCMR2_Output; // 0x1C capture/compare mode register 2 (output mode)
    volatile uint32_t CCMR2_Input ; // 0x1C capture/compare mode register 2 (input mode)
    volatile uint32_t CCER        ; // 0x20 capture/compare enable register
    volatile uint32_t CNT         ; // 0x24 counter
    volatile uint32_t PSC         ; // 0x28 prescaler
    volatile uint32_t ARR         ; // 0x2C auto-reload register
    volatile uint32_t RCR         ; // 0x30 repetition counter register
    volatile uint32_t CCR1        ; // 0x34 capture/compare register 1
    volatile uint32_t CCR2        ; // 0x38 capture/compare register 2
    volatile uint32_t CCR3        ; // 0x3C capture/compare register 3
    volatile uint32_t CCR4        ; // 0x40 capture/compare register 4
    volatile uint32_t BDTR        ; // 0x44 break and dead-time register
    volatile uint32_t DCR         ; // 0x48 DMA control register
    volatile uint32_t DMAR        ; // 0x4C DMA address for full transfer
} TIM1_TypeDef;

#define TIM1   ((TIM1_TypeDef *) 0x40010000UL)

typedef struct {
    volatile uint32_t CR1         ; // 0x00 control register 1
    volatile uint32_t CR2         ; // 0x04 control register 2
    volatile uint32_t SMCR        ; // 0x08 slave mode control register
    volatile uint32_t DIER        ; // 0x0C DMA/Interrupt enable register
    volatile uint32_t SR          ; // 0x10 status register
    volatile uint32_t EGR         ; // 0x14 event generation register
    volatile uint32_t CCMR1_Output; // 0x18 capture/compare mode register 1 (output mode)
    volatile uint32_t CCMR1_Input ; // 0x18 capture/compare mode register 1 (input mode)
    volatile uint32_t CCMR2_Output; // 0x1C capture/compare mode register 2 (output mode)
    volatile uint32_t CCMR2_Input ; // 0x1C capture/compare mode register 2 (input mode)
    volatile uint32_t CCER        ; // 0x20 capture/compare enable register
    volatile uint32_t CNT         ; // 0x24 counter
    volatile uint32_t PSC         ; // 0x28 prescaler
    volatile uint32_t ARR         ; // 0x2C auto-reload register
    volatile uint32_t RESERVED_0[1]; // 0x30 - 0x33
    volatile uint32_t CCR1        ; // 0x34 capture/compare register 1
    volatile uint32_t CCR2        ; // 0x38 capture/compare register 2
    volatile uint32_t CCR3        ; // 0x3C capture/compare register 3
    volatile uint32_t CCR4        ; // 0x40 capture/compare register 4
    volatile uint32_t RESERVED_1[1]; // 0x44 - 0x47
    volatile uint32_t DCR         ; // 0x48 DMA control register
    volatile uint32_t DMAR        ; // 0x4C DMA address for full transfer
    volatile uint32_t OR          ; // 0x50 TIM5 option register
} TIM2_TypeDef;

#define TIM2   ((TIM2_TypeDef *) 0x40000000UL)

typedef struct {
    volatile uint32_t CR1         ; // 0x00 control register 1
    volatile uint32_t CR2         ; // 0x04 control register 2
    volatile uint32_t SMCR        ; // 0x08 slave mode control register
    volatile uint32_t DIER        ; // 0x0C DMA/Interrupt enable register
    volatile uint32_t SR          ; // 0x10 status register
    volatile uint32_t EGR         ; // 0x14 event generation register
    volatile uint32_t CCMR1_Output; // 0x18 capture/compare mode register 1 (output mode)
    volatile uint32_t CCMR1_Input ; // 0x18 capture/compare mode register 1 (input mode)
    volatile uint32_t CCMR2_Output; // 0x1C capture/compare mode register 2 (output mode)
    volatile uint32_t CCMR2_Input ; // 0x1C capture/compare mode register 2 (input mode)
    volatile uint32_t CCER        ; // 0x20 capture/compare enable register
    volatile uint32_t CNT         ; // 0x24 counter
    volatile uint32_t PSC         ; // 0x28 prescaler
    volatile uint32_t ARR         ; // 0x2C auto-reload register
    volatile uint32_t RESERVED_0[1]; // 0x30 - 0x33
    volatile uint32_t CCR1        ; // 0x34 capture/compare register 1
    volatile uint32_t CCR2        ; // 0x38 capture/compare register 2
    volatile uint32_t CCR3        ; // 0x3C capture/compare register 3
    volatile uint32_t CCR4        ; // 0x40 capture/compare register 4
    volatile uint32_t RESERVED_1[1]; // 0x44 - 0x47
    volatile uint32_t DCR         ; // 0x48 DMA control register
    volatile uint32_t DMAR        ; // 0x4C DMA address for full transfer
} TIM3_TypeDef;

#define TIM3   ((TIM3_TypeDef *) 0x40000400UL)

typedef struct {
    volatile uint32_t CR1         ; // 0x00 control register 1
    volatile uint32_t CR2         ; // 0x04 control register 2
    volatile uint32_t SMCR        ; // 0x08 slave mode control register
    volatile uint32_t DIER        ; // 0x0C DMA/Interrupt enable register
    volatile uint32_t SR          ; // 0x10 status register
    volatile uint32_t EGR         ; // 0x14 event generation register
    volatile uint32_t CCMR1_Output; // 0x18 capture/compare mode register 1 (output mode)
    volatile uint32_t CCMR1_Input ; // 0x18 capture/compare mode register 1 (input mode)
    volatile uint32_t CCMR2_Output; // 0x1C capture/compare mode register 2 (output mode)
    volatile uint32_t CCMR2_Input ; // 0x1C capture/compare mode register 2 (input mode)
    volatile uint32_t CCER        ; // 0x20 capture/compare enable register
    volatile uint32_t CNT         ; // 0x24 counter
    volatile uint32_t PSC         ; // 0x28 prescaler
    volatile uint32_t ARR         ; // 0x2C auto-reload register
    volatile uint32_t RESERVED_0[1]; // 0x30 - 0x33
    volatile uint32_t CCR1        ; // 0x34 capture/compare register 1
    volatile uint32_t CCR2        ; // 0x38 capture/compare register 2
    volatile uint32_t CCR3        ; // 0x3C capture/compare register 3
    volatile uint32_t CCR4        ; // 0x40 capture/compare register 4
    volatile uint32_t RESERVED_1[1]; // 0x44 - 0x47
    volatile uint32_t DCR         ; // 0x48 DMA control register
    volatile uint32_t DMAR        ; // 0x4C DMA address for full transfer
    volatile uint32_t OR          ; // 0x50 TIM5 option register
} TIM5_TypeDef;

#define TIM5   ((TIM5_TypeDef *) 0x40000C00UL)

