jbvalle/kx_regs/stm32f429zi_regs.h
typedef struct {
    volatile uint32_t CR1         ; // 0x00 control register 1
    volatile uint32_t CR2         ; // 0x04 control register 2
    volatile uint32_t SMCR        ; // 0x08 slave mode control register
    volatile uint32_t DIER        ; // 0x0C DMA/Interrupt enable register
    volatile uint32_t SR          ; // 0x10 status register
    volatile uint32_t EGR         ; // 0x14 event generation register
    volatile uint32_t CCMR1_Output; // 0x18 capture/compare mode register 1 (output mode)
    volatile uint32_t CCMR1_Input ; // 0x18 capture/compare mode register 1 (input mode)
    volatile uint32_t RESERVED_0[1]; // 0x1C - 0x1F
    volatile uint32_t CCER        ; // 0x20 capture/compare enable register
    volatile uint32_t CNT         ; // 0x24 counter
    volatile uint32_t PSC         ; // 0x28 prescaler
    volatile uint32_t ARR         ; // 0x2C auto-reload register
    volatile uint32_t RESERVED_1[1]; // 0x30 - 0x33
    volatile uint32_t CCR1        ; // 0x34 capture/compare register 1
    volatile uint32_t CCR2        ; // 0x38 capture/compare register 2
} TIM9_TypeDef;

#define TIM9   ((TIM9_TypeDef *) 0x40014000UL)

typedef struct {
    volatile uint32_t CR1         ; // 0x00 control register 1
    volatile uint32_t RESERVED_0[2]; // 0x04 - 0x0B
    volatile uint32_t DIER        ; // 0x0C DMA/Interrupt enable register
    volatile uint32_t SR          ; // 0x10 status register
    volatile uint32_t EGR         ; // 0x14 event generation register
    volatile uint32_t CCMR1_Output; // 0x18 capture/compare mode register 1 (output mode)
    volatile uint32_t CCMR1_Input ; // 0x18 capture/compare mode register 1 (input mode)
    volatile uint32_t RESERVED_1[1]; // 0x1C - 0x1F
    volatile uint32_t CCER        ; // 0x20 capture/compare enable register
    volatile uint32_t CNT         ; // 0x24 counter
    volatile uint32_t PSC         ; // 0x28 prescaler
    volatile uint32_t ARR         ; // 0x2C auto-reload register
    volatile uint32_t RESERVED_2[1]; // 0x30 - 0x33
    volatile uint32_t CCR1        ; // 0x34 capture/compare register 1
} TIM10_TypeDef;

#define TIM10   ((TIM10_TypeDef *) 0x40014400UL)

typedef struct {
    volatile uint32_t CR1         ; // 0x00 control register 1
    volatile uint32_t RESERVED_0[2]; // 0x04 - 0x0B
    volatile uint32_t DIER        ; // 0x0C DMA/Interrupt enable register
    volatile uint32_t SR          ; // 0x10 status register
    volatile uint32_t EGR         ; // 0x14 event generation register
    volatile uint32_t CCMR1_Output; // 0x18 capture/compare mode register 1 (output mode)
    volatile uint32_t CCMR1_Input ; // 0x18 capture/compare mode register 1 (input mode)
    volatile uint32_t RESERVED_1[1]; // 0x1C - 0x1F
    volatile uint32_t CCER        ; // 0x20 capture/compare enable register
    volatile uint32_t CNT         ; // 0x24 counter
    volatile uint32_t PSC         ; // 0x28 prescaler
    volatile uint32_t ARR         ; // 0x2C auto-reload register
    volatile uint32_t RESERVED_2[1]; // 0x30 - 0x33
    volatile uint32_t CCR1        ; // 0x34 capture/compare register 1
    volatile uint32_t RESERVED_3[6]; // 0x38 - 0x4F
    volatile uint32_t OR          ; // 0x50 option register
} TIM11_TypeDef;

#define TIM11   ((TIM11_TypeDef *) 0x40014800UL)

typedef struct {
    volatile uint32_t CR1         ; // 0x00 control register 1
    volatile uint32_t CR2         ; // 0x04 control register 2
    volatile uint32_t RESERVED_0[1]; // 0x08 - 0x0B
    volatile uint32_t DIER        ; // 0x0C DMA/Interrupt enable register
    volatile uint32_t SR          ; // 0x10 status register
    volatile uint32_t EGR         ; // 0x14 event generation register
    volatile uint32_t RESERVED_1[3]; // 0x18 - 0x23
    volatile uint32_t CNT         ; // 0x24 counter
    volatile uint32_t PSC         ; // 0x28 prescaler
    volatile uint32_t ARR         ; // 0x2C auto-reload register
} TIM6_TypeDef;

#define TIM6   ((TIM6_TypeDef *) 0x40001000UL)

typedef struct {
    volatile uint32_t MACCR       ; // 0x00 Ethernet MAC configuration register
    volatile uint32_t MACFFR      ; // 0x04 Ethernet MAC frame filter register
    volatile uint32_t MACHTHR     ; // 0x08 Ethernet MAC hash table high register
    volatile uint32_t MACHTLR     ; // 0x0C Ethernet MAC hash table low register
    volatile uint32_t MACMIIAR    ; // 0x10 Ethernet MAC MII address register
    volatile uint32_t MACMIIDR    ; // 0x14 Ethernet MAC MII data register
    volatile uint32_t MACFCR      ; // 0x18 Ethernet MAC flow control register
    volatile uint32_t MACVLANTR   ; // 0x1C Ethernet MAC VLAN tag register
    volatile uint32_t RESERVED_0[3]; // 0x20 - 0x2B
    volatile uint32_t MACPMTCSR   ; // 0x2C Ethernet MAC PMT control and status register
    volatile uint32_t RESERVED_1[1]; // 0x30 - 0x33
    volatile uint32_t MACDBGR     ; // 0x34 Ethernet MAC debug register
    volatile uint32_t MACSR       ; // 0x38 Ethernet MAC interrupt status register
    volatile uint32_t MACIMR      ; // 0x3C Ethernet MAC interrupt mask register
    volatile uint32_t MACA0HR     ; // 0x40 Ethernet MAC address 0 high register
    volatile uint32_t MACA0LR     ; // 0x44 Ethernet MAC address 0 low register
    volatile uint32_t MACA1HR     ; // 0x48 Ethernet MAC address 1 high register
    volatile uint32_t MACA1LR     ; // 0x4C Ethernet MAC address1 low register
    volatile uint32_t MACA2HR     ; // 0x50 Ethernet MAC address 2 high register
    volatile uint32_t MACA2LR     ; // 0x54 Ethernet MAC address 2 low register
    volatile uint32_t MACA3HR     ; // 0x58 Ethernet MAC address 3 high register
    volatile uint32_t MACA3LR     ; // 0x5C Ethernet MAC address 3 low register
} ETHERNET_MAC_TypeDef;

#define ETHERNET_MAC   ((ETHERNET_MAC_TypeDef *) 0x40028000UL)

typedef struct {
    volatile uint32_t MMCCR       ; // 0x00 Ethernet MMC control register
    volatile uint32_t MMCRIR      ; // 0x04 Ethernet MMC receive interrupt register
    volatile uint32_t MMCTIR      ; // 0x08 Ethernet MMC transmit interrupt register
    volatile uint32_t MMCRIMR     ; // 0x0C Ethernet MMC receive interrupt mask register
    volatile uint32_t MMCTIMR     ; // 0x10 Ethernet MMC transmit interrupt mask register
    volatile uint32_t RESERVED_0[14]; // 0x14 - 0x4B
    volatile uint32_t MMCTGFSCCR  ; // 0x4C Ethernet MMC transmitted good frames after a single collision counter
    volatile uint32_t MMCTGFMSCCR ; // 0x50 Ethernet MMC transmitted good frames after more than a single collision
    volatile uint32_t RESERVED_1[5]; // 0x54 - 0x67
    volatile uint32_t MMCTGFCR    ; // 0x68 Ethernet MMC transmitted good frames counter register
    volatile uint32_t RESERVED_2[10]; // 0x6C - 0x93
    volatile uint32_t MMCRFCECR   ; // 0x94 Ethernet MMC received frames with CRC error counter register
    volatile uint32_t MMCRFAECR   ; // 0x98 Ethernet MMC received frames with alignment error counter register
    volatile uint32_t RESERVED_3[10]; // 0x9C - 0xC3
    volatile uint32_t MMCRGUFCR   ; // 0xC4 MMC received good unicast frames counter register
} ETHERNET_MMC_TypeDef;

#define ETHERNET_MMC   ((ETHERNET_MMC_TypeDef *) 0x40028100UL)

