jbvalle/kx_regs/stm32f429zi_regs.h
typedef struct {
    volatile uint32_t FS_DCFG     ; // 0x00 OTG_FS device configuration register (OTG_FS_DCFG)
    volatile uint32_t FS_DCTL     ; // 0x04 OTG_FS device control register (OTG_FS_DCTL)
    volatile uint32_t FS_DSTS     ; // 0x08 OTG_FS device status register (OTG_FS_DSTS)
    volatile uint32_t RESERVED_0[1]; // 0x0C - 0x0F
    volatile uint32_t FS_DIEPMSK  ; // 0x10 OTG_FS device IN endpoint common interrupt mask register (OTG_FS_DIEPMSK)
    volatile uint32_t FS_DOEPMSK  ; // 0x14 OTG_FS device OUT endpoint common interrupt mask register (OTG_FS_DOEPMSK)
    volatile uint32_t FS_DAINT    ; // 0x18 OTG_FS device all endpoints interrupt register (OTG_FS_DAINT)
    volatile uint32_t FS_DAINTMSK ; // 0x1C OTG_FS all endpoints interrupt mask register (OTG_FS_DAINTMSK)
    volatile uint32_t RESERVED_1[2]; // 0x20 - 0x27
    volatile uint32_t DVBUSDIS    ; // 0x28 OTG_FS device VBUS discharge time register
    volatile uint32_t DVBUSPULSE  ; // 0x2C OTG_FS device VBUS pulsing time register
    volatile uint32_t RESERVED_2[1]; // 0x30 - 0x33
    volatile uint32_t DIEPEMPMSK  ; // 0x34 OTG_FS device IN endpoint FIFO empty interrupt mask register
    volatile uint32_t RESERVED_3[50]; // 0x38 - 0xFF
    volatile uint32_t FS_DIEPCTL0 ; // 0x100 OTG_FS device control IN endpoint 0 control register (OTG_FS_DIEPCTL0)
    volatile uint32_t RESERVED_4[1]; // 0x104 - 0x107
    volatile uint32_t DIEPINT0    ; // 0x108 device endpoint-interrupt register
    volatile uint32_t RESERVED_5[1]; // 0x10C - 0x10F
    volatile uint32_t DIEPTSIZ0   ; // 0x110 device endpoint-0 transfer size register
    volatile uint32_t RESERVED_6[1]; // 0x114 - 0x117
    volatile uint32_t DTXFSTS0    ; // 0x118 OTG_FS device IN endpoint transmit FIFO status register
    volatile uint32_t RESERVED_7[1]; // 0x11C - 0x11F
    volatile uint32_t DIEPCTL1    ; // 0x120 OTG device endpoint-1 control register
    volatile uint32_t RESERVED_8[1]; // 0x124 - 0x127
    volatile uint32_t DIEPINT1    ; // 0x128 device endpoint-1 interrupt register
    volatile uint32_t RESERVED_9[1]; // 0x12C - 0x12F
    volatile uint32_t DIEPTSIZ1   ; // 0x130 device endpoint-1 transfer size register
    volatile uint32_t RESERVED_10[1]; // 0x134 - 0x137
    volatile uint32_t DTXFSTS1    ; // 0x138 OTG_FS device IN endpoint transmit FIFO status register
    volatile uint32_t RESERVED_11[1]; // 0x13C - 0x13F
    volatile uint32_t DIEPCTL2    ; // 0x140 OTG device endpoint-2 control register
    volatile uint32_t RESERVED_12[1]; // 0x144 - 0x147
    volatile uint32_t DIEPINT2    ; // 0x148 device endpoint-2 interrupt register
    volatile uint32_t RESERVED_13[1]; // 0x14C - 0x14F
    volatile uint32_t DIEPTSIZ2   ; // 0x150 device endpoint-2 transfer size register
    volatile uint32_t RESERVED_14[1]; // 0x154 - 0x157
    volatile uint32_t DTXFSTS2    ; // 0x158 OTG_FS device IN endpoint transmit FIFO status register
    volatile uint32_t RESERVED_15[1]; // 0x15C - 0x15F
    volatile uint32_t DIEPCTL3    ; // 0x160 OTG device endpoint-3 control register
    volatile uint32_t RESERVED_16[1]; // 0x164 - 0x167
    volatile uint32_t DIEPINT3    ; // 0x168 device endpoint-3 interrupt register
    volatile uint32_t RESERVED_17[1]; // 0x16C - 0x16F
    volatile uint32_t DIEPTSIZ3   ; // 0x170 device endpoint-3 transfer size register
    volatile uint32_t RESERVED_18[1]; // 0x174 - 0x177
    volatile uint32_t DTXFSTS3    ; // 0x178 OTG_FS device IN endpoint transmit FIFO status register
    volatile uint32_t RESERVED_19[97]; // 0x17C - 0x2FF
    volatile uint32_t DOEPCTL0    ; // 0x300 device endpoint-0 control register
    volatile uint32_t RESERVED_20[1]; // 0x304 - 0x307
    volatile uint32_t DOEPINT0    ; // 0x308 device endpoint-0 interrupt register
    volatile uint32_t RESERVED_21[1]; // 0x30C - 0x30F
    volatile uint32_t DOEPTSIZ0   ; // 0x310 device OUT endpoint-0 transfer size register
    volatile uint32_t RESERVED_22[3]; // 0x314 - 0x31F
    volatile uint32_t DOEPCTL1    ; // 0x320 device endpoint-1 control register
    volatile uint32_t RESERVED_23[1]; // 0x324 - 0x327
    volatile uint32_t DOEPINT1    ; // 0x328 device endpoint-1 interrupt register
    volatile uint32_t RESERVED_24[1]; // 0x32C - 0x32F
    volatile uint32_t DOEPTSIZ1   ; // 0x330 device OUT endpoint-1 transfer size register
    volatile uint32_t RESERVED_25[3]; // 0x334 - 0x33F
    volatile uint32_t DOEPCTL2    ; // 0x340 device endpoint-2 control register
    volatile uint32_t RESERVED_26[1]; // 0x344 - 0x347
    volatile uint32_t DOEPINT2    ; // 0x348 device endpoint-2 interrupt register
    volatile uint32_t RESERVED_27[1]; // 0x34C - 0x34F
    volatile uint32_t DOEPTSIZ2   ; // 0x350 device OUT endpoint-2 transfer size register
    volatile uint32_t RESERVED_28[3]; // 0x354 - 0x35F
    volatile uint32_t DOEPCTL3    ; // 0x360 device endpoint-3 control register
    volatile uint32_t RESERVED_29[1]; // 0x364 - 0x367
    volatile uint32_t DOEPINT3    ; // 0x368 device endpoint-3 interrupt register
    volatile uint32_t RESERVED_30[1]; // 0x36C - 0x36F
    volatile uint32_t DOEPTSIZ3   ; // 0x370 device OUT endpoint-3 transfer size register
} OTG_FS_DEVICE_TypeDef;

#define OTG_FS_DEVICE   ((OTG_FS_DEVICE_TypeDef *) 0x50000800UL)

typedef struct {
    volatile uint32_t FS_PCGCCTL  ; // 0x00 OTG_FS power and clock gating control register (OTG_FS_PCGCCTL)
} OTG_FS_PWRCLK_TypeDef;

#define OTG_FS_PWRCLK   ((OTG_FS_PWRCLK_TypeDef *) 0x50000E00UL)

typedef struct {
    volatile uint32_t MCR         ; // 0x00 master control register
    volatile uint32_t MSR         ; // 0x04 master status register
    volatile uint32_t TSR         ; // 0x08 transmit status register
    volatile uint32_t RF0R        ; // 0x0C receive FIFO 0 register
    volatile uint32_t RF1R        ; // 0x10 receive FIFO 1 register
    volatile uint32_t IER         ; // 0x14 interrupt enable register
    volatile uint32_t ESR         ; // 0x18 interrupt enable register
    volatile uint32_t BTR         ; // 0x1C bit timing register
    volatile uint32_t RESERVED_0[88]; // 0x20 - 0x17F
    volatile uint32_t TI0R        ; // 0x180 TX mailboidentifier register
    volatile uint32_t TDT0R       ; // 0x184 mailbodata length control and time stamp register
    volatile uint32_t TDL0R       ; // 0x188 mailbodata low register
    volatile uint32_t TDH0R       ; // 0x18C mailbodata high register
    volatile uint32_t TI1R        ; // 0x190 mailboidentifier register
    volatile uint32_t TDT1R       ; // 0x194 mailbodata length control and time stamp register
    volatile uint32_t TDL1R       ; // 0x198 mailbodata low register
    volatile uint32_t TDH1R       ; // 0x19C mailbodata high register
    volatile uint32_t TI2R        ; // 0x1A0 mailboidentifier register
    volatile uint32_t TDT2R       ; // 0x1A4 mailbodata length control and time stamp register
    volatile uint32_t TDL2R       ; // 0x1A8 mailbodata low register
    volatile uint32_t TDH2R       ; // 0x1AC mailbodata high register
    volatile uint32_t RI0R        ; // 0x1B0 receive FIFO mailboidentifier register
    volatile uint32_t RDT0R       ; // 0x1B4 mailbodata high register
    volatile uint32_t RDL0R       ; // 0x1B8 mailbodata high register
    volatile uint32_t RDH0R       ; // 0x1BC receive FIFO mailbodata high register
    volatile uint32_t RI1R        ; // 0x1C0 mailbodata high register
    volatile uint32_t RDT1R       ; // 0x1C4 mailbodata high register
    volatile uint32_t RDL1R       ; // 0x1C8 mailbodata high register
    volatile uint32_t RDH1R       ; // 0x1CC mailbodata high register
    volatile uint32_t RESERVED_1[12]; // 0x1D0 - 0x1FF
    volatile uint32_t FMR         ; // 0x200 filter master register
    volatile uint32_t FM1R        ; // 0x204 filter mode register
    volatile uint32_t RESERVED_2[1]; // 0x208 - 0x20B
    volatile uint32_t FS1R        ; // 0x20C filter scale register
    volatile uint32_t RESERVED_3[1]; // 0x210 - 0x213
    volatile uint32_t FFA1R       ; // 0x214 filter FIFO assignment register
    volatile uint32_t RESERVED_4[1]; // 0x218 - 0x21B
    volatile uint32_t FA1R        ; // 0x21C filter activation register
    volatile uint32_t RESERVED_5[8]; // 0x220 - 0x23F
    volatile uint32_t F0R1        ; // 0x240 Filter bank 0 register 1
    volatile uint32_t F0R2        ; // 0x244 Filter bank 0 register 2
    volatile uint32_t F1R1        ; // 0x248 Filter bank 1 register 1
    volatile uint32_t F1R2        ; // 0x24C Filter bank 1 register 2
    volatile uint32_t F2R1        ; // 0x250 Filter bank 2 register 1
    volatile uint32_t F2R2        ; // 0x254 Filter bank 2 register 2
    volatile uint32_t F3R1        ; // 0x258 Filter bank 3 register 1
    volatile uint32_t F3R2        ; // 0x25C Filter bank 3 register 2
    volatile uint32_t F4R1        ; // 0x260 Filter bank 4 register 1
    volatile uint32_t F4R2        ; // 0x264 Filter bank 4 register 2
    volatile uint32_t F5R1        ; // 0x268 Filter bank 5 register 1
    volatile uint32_t F5R2        ; // 0x26C Filter bank 5 register 2
    volatile uint32_t F6R1        ; // 0x270 Filter bank 6 register 1
    volatile uint32_t F6R2        ; // 0x274 Filter bank 6 register 2
    volatile uint32_t F7R1        ; // 0x278 Filter bank 7 register 1
    volatile uint32_t F7R2        ; // 0x27C Filter bank 7 register 2
    volatile uint32_t F8R1        ; // 0x280 Filter bank 8 register 1
    volatile uint32_t F8R2        ; // 0x284 Filter bank 8 register 2
    volatile uint32_t F9R1        ; // 0x288 Filter bank 9 register 1
    volatile uint32_t F9R2        ; // 0x28C Filter bank 9 register 2
    volatile uint32_t F10R1       ; // 0x290 Filter bank 10 register 1
    volatile uint32_t F10R2       ; // 0x294 Filter bank 10 register 2
    volatile uint32_t F11R1       ; // 0x298 Filter bank 11 register 1
    volatile uint32_t F11R2       ; // 0x29C Filter bank 11 register 2
    volatile uint32_t F12R1       ; // 0x2A0 Filter bank 4 register 1
    volatile uint32_t F12R2       ; // 0x2A4 Filter bank 12 register 2
    volatile uint32_t F13R1       ; // 0x2A8 Filter bank 13 register 1
    volatile uint32_t F13R2       ; // 0x2AC Filter bank 13 register 2
    volatile uint32_t F14R1       ; // 0x2B0 Filter bank 14 register 1
    volatile uint32_t F14R2       ; // 0x2B4 Filter bank 14 register 2
    volatile uint32_t F15R1       ; // 0x2B8 Filter bank 15 register 1
    volatile uint32_t F15R2       ; // 0x2BC Filter bank 15 register 2
    volatile uint32_t F16R1       ; // 0x2C0 Filter bank 16 register 1
    volatile uint32_t F16R2       ; // 0x2C4 Filter bank 16 register 2
    volatile uint32_t F17R1       ; // 0x2C8 Filter bank 17 register 1
    volatile uint32_t F17R2       ; // 0x2CC Filter bank 17 register 2
    volatile uint32_t F18R1       ; // 0x2D0 Filter bank 18 register 1
    volatile uint32_t F18R2       ; // 0x2D4 Filter bank 18 register 2
    volatile uint32_t F19R1       ; // 0x2D8 Filter bank 19 register 1
    volatile uint32_t F19R2       ; // 0x2DC Filter bank 19 register 2
    volatile uint32_t F20R1       ; // 0x2E0 Filter bank 20 register 1
    volatile uint32_t F20R2       ; // 0x2E4 Filter bank 20 register 2
    volatile uint32_t F21R1       ; // 0x2E8 Filter bank 21 register 1
    volatile uint32_t F21R2       ; // 0x2EC Filter bank 21 register 2
    volatile uint32_t F22R1       ; // 0x2F0 Filter bank 22 register 1
    volatile uint32_t F22R2       ; // 0x2F4 Filter bank 22 register 2
    volatile uint32_t F23R1       ; // 0x2F8 Filter bank 23 register 1
    volatile uint32_t F23R2       ; // 0x2FC Filter bank 23 register 2
    volatile uint32_t F24R1       ; // 0x300 Filter bank 24 register 1
    volatile uint32_t F24R2       ; // 0x304 Filter bank 24 register 2
    volatile uint32_t F25R1       ; // 0x308 Filter bank 25 register 1
    volatile uint32_t F25R2       ; // 0x30C Filter bank 25 register 2
    volatile uint32_t F26R1       ; // 0x310 Filter bank 26 register 1
    volatile uint32_t F26R2       ; // 0x314 Filter bank 26 register 2
    volatile uint32_t F27R1       ; // 0x318 Filter bank 27 register 1
    volatile uint32_t F27R2       ; // 0x31C Filter bank 27 register 2
} CAN1_TypeDef;

#define CAN1   ((CAN1_TypeDef *) 0x40006400UL)

