jbvalle/kx_regs/stm32f429zi_regs.h
typedef struct {
    volatile uint32_t ACR         ; // 0x00 Flash access control register
    volatile uint32_t KEYR        ; // 0x04 Flash key register
    volatile uint32_t OPTKEYR     ; // 0x08 Flash option key register
    volatile uint32_t SR          ; // 0x0C Status register
    volatile uint32_t CR          ; // 0x10 Control register
    volatile uint32_t OPTCR       ; // 0x14 Flash option control register
    volatile uint32_t OPTCR1      ; // 0x18 Flash option control register 1
} FLASH_TypeDef;

#define FLASH   ((FLASH_TypeDef *) 0x40023C00UL)

typedef struct {
    volatile uint32_t IMR         ; // 0x00 Interrupt mask register (EXTI_IMR)
    volatile uint32_t EMR         ; // 0x04 Event mask register (EXTI_EMR)
    volatile uint32_t RTSR        ; // 0x08 Rising Trigger selection register (EXTI_RTSR)
    volatile uint32_t FTSR        ; // 0x0C Falling Trigger selection register (EXTI_FTSR)
    volatile uint32_t SWIER       ; // 0x10 Software interrupt event register (EXTI_SWIER)
    volatile uint32_t PR          ; // 0x14 Pending register (EXTI_PR)
} EXTI_TypeDef;

#define EXTI   ((EXTI_TypeDef *) 0x40013C00UL)

typedef struct {
    volatile uint32_t OTG_HS_GOTGCTL; // 0x00 OTG_HS control and status register
    volatile uint32_t OTG_HS_GOTGINT; // 0x04 OTG_HS interrupt register
    volatile uint32_t OTG_HS_GAHBCFG; // 0x08 OTG_HS AHB configuration register
    volatile uint32_t OTG_HS_GUSBCFG; // 0x0C OTG_HS USB configuration register
    volatile uint32_t OTG_HS_GRSTCTL; // 0x10 OTG_HS reset register
    volatile uint32_t OTG_HS_GINTSTS; // 0x14 OTG_HS core interrupt register
    volatile uint32_t OTG_HS_GINTMSK; // 0x18 OTG_HS interrupt mask register
    volatile uint32_t OTG_HS_GRXSTSR_Host; // 0x1C OTG_HS Receive status debug read register (host mode)
    volatile uint32_t OTG_HS_GRXSTSR_Peripheral; // 0x1C OTG_HS Receive status debug read register (peripheral mode mode)
    volatile uint32_t OTG_HS_GRXSTSP_Host; // 0x20 OTG_HS status read and pop register (host mode)
    volatile uint32_t OTG_HS_GRXSTSP_Peripheral; // 0x20 OTG_HS status read and pop register (peripheral mode)
    volatile uint32_t OTG_HS_GRXFSIZ; // 0x24 OTG_HS Receive FIFO size register
    volatile uint32_t OTG_HS_GNPTXFSIZ_Host; // 0x28 OTG_HS nonperiodic transmit FIFO size register (host mode)
    volatile uint32_t OTG_HS_TX0FSIZ_Peripheral; // 0x28 Endpoint 0 transmit FIFO size (peripheral mode)
    volatile uint32_t OTG_HS_GNPTXSTS; // 0x2C OTG_HS nonperiodic transmit FIFO/queue status register
    volatile uint32_t RESERVED_0[2]; // 0x30 - 0x37
    volatile uint32_t OTG_HS_GCCFG; // 0x38 OTG_HS general core configuration register
    volatile uint32_t OTG_HS_CID  ; // 0x3C OTG_HS core ID register
    volatile uint32_t RESERVED_1[48]; // 0x40 - 0xFF
    volatile uint32_t OTG_HS_HPTXFSIZ; // 0x100 OTG_HS Host periodic transmit FIFO size register
    volatile uint32_t OTG_HS_DIEPTXF1; // 0x104 OTG_HS device IN endpoint transmit FIFO size register
    volatile uint32_t OTG_HS_DIEPTXF2; // 0x108 OTG_HS device IN endpoint transmit FIFO size register
    volatile uint32_t RESERVED_2[4]; // 0x10C - 0x11B
    volatile uint32_t OTG_HS_DIEPTXF3; // 0x11C OTG_HS device IN endpoint transmit FIFO size register
    volatile uint32_t OTG_HS_DIEPTXF4; // 0x120 OTG_HS device IN endpoint transmit FIFO size register
    volatile uint32_t OTG_HS_DIEPTXF5; // 0x124 OTG_HS device IN endpoint transmit FIFO size register
    volatile uint32_t OTG_HS_DIEPTXF6; // 0x128 OTG_HS device IN endpoint transmit FIFO size register
    volatile uint32_t OTG_HS_DIEPTXF7; // 0x12C OTG_HS device IN endpoint transmit FIFO size register
} OTG_HS_GLOBAL_TypeDef;

#define OTG_HS_GLOBAL   ((OTG_HS_GLOBAL_TypeDef *) 0x40040000UL)

typedef struct {
    volatile uint32_t OTG_HS_HCFG ; // 0x00 OTG_HS host configuration register
    volatile uint32_t OTG_HS_HFIR ; // 0x04 OTG_HS Host frame interval register
    volatile uint32_t OTG_HS_HFNUM; // 0x08 OTG_HS host frame number/frame time remaining register
    volatile uint32_t RESERVED_0[1]; // 0x0C - 0x0F
    volatile uint32_t OTG_HS_HPTXSTS; // 0x10 OTG_HS_Host periodic transmit FIFO/queue status register
    volatile uint32_t OTG_HS_HAINT; // 0x14 OTG_HS Host all channels interrupt register
    volatile uint32_t OTG_HS_HAINTMSK; // 0x18 OTG_HS host all channels interrupt mask register
    volatile uint32_t RESERVED_1[9]; // 0x1C - 0x3F
    volatile uint32_t OTG_HS_HPRT ; // 0x40 OTG_HS host port control and status register
    volatile uint32_t RESERVED_2[47]; // 0x44 - 0xFF
    volatile uint32_t OTG_HS_HCCHAR0; // 0x100 OTG_HS host channel-0 characteristics register
    volatile uint32_t OTG_HS_HCSPLT0; // 0x104 OTG_HS host channel-0 split control register
    volatile uint32_t OTG_HS_HCINT0; // 0x108 OTG_HS host channel-11 interrupt register
    volatile uint32_t OTG_HS_HCINTMSK0; // 0x10C OTG_HS host channel-11 interrupt mask register
    volatile uint32_t OTG_HS_HCTSIZ0; // 0x110 OTG_HS host channel-11 transfer size register
    volatile uint32_t OTG_HS_HCDMA0; // 0x114 OTG_HS host channel-0 DMA address register
    volatile uint32_t RESERVED_3[2]; // 0x118 - 0x11F
    volatile uint32_t OTG_HS_HCCHAR1; // 0x120 OTG_HS host channel-1 characteristics register
    volatile uint32_t OTG_HS_HCSPLT1; // 0x124 OTG_HS host channel-1 split control register
    volatile uint32_t OTG_HS_HCINT1; // 0x128 OTG_HS host channel-1 interrupt register
    volatile uint32_t OTG_HS_HCINTMSK1; // 0x12C OTG_HS host channel-1 interrupt mask register
    volatile uint32_t OTG_HS_HCTSIZ1; // 0x130 OTG_HS host channel-1 transfer size register
    volatile uint32_t OTG_HS_HCDMA1; // 0x134 OTG_HS host channel-1 DMA address register
    volatile uint32_t RESERVED_4[2]; // 0x138 - 0x13F
    volatile uint32_t OTG_HS_HCCHAR2; // 0x140 OTG_HS host channel-2 characteristics register
    volatile uint32_t OTG_HS_HCSPLT2; // 0x144 OTG_HS host channel-2 split control register
    volatile uint32_t OTG_HS_HCINT2; // 0x148 OTG_HS host channel-2 interrupt register
    volatile uint32_t OTG_HS_HCINTMSK2; // 0x14C OTG_HS host channel-2 interrupt mask register
    volatile uint32_t OTG_HS_HCTSIZ2; // 0x150 OTG_HS host channel-2 transfer size register
    volatile uint32_t OTG_HS_HCDMA2; // 0x154 OTG_HS host channel-2 DMA address register
    volatile uint32_t RESERVED_5[2]; // 0x158 - 0x15F
    volatile uint32_t OTG_HS_HCCHAR3; // 0x160 OTG_HS host channel-3 characteristics register
    volatile uint32_t OTG_HS_HCSPLT3; // 0x164 OTG_HS host channel-3 split control register
    volatile uint32_t OTG_HS_HCINT3; // 0x168 OTG_HS host channel-3 interrupt register
    volatile uint32_t OTG_HS_HCINTMSK3; // 0x16C OTG_HS host channel-3 interrupt mask register
    volatile uint32_t OTG_HS_HCTSIZ3; // 0x170 OTG_HS host channel-3 transfer size register
    volatile uint32_t OTG_HS_HCDMA3; // 0x174 OTG_HS host channel-3 DMA address register
    volatile uint32_t RESERVED_6[2]; // 0x178 - 0x17F
    volatile uint32_t OTG_HS_HCCHAR4; // 0x180 OTG_HS host channel-4 characteristics register
    volatile uint32_t OTG_HS_HCSPLT4; // 0x184 OTG_HS host channel-4 split control register
    volatile uint32_t OTG_HS_HCINT4; // 0x188 OTG_HS host channel-4 interrupt register
    volatile uint32_t OTG_HS_HCINTMSK4; // 0x18C OTG_HS host channel-4 interrupt mask register
    volatile uint32_t OTG_HS_HCTSIZ4; // 0x190 OTG_HS host channel-4 transfer size register
    volatile uint32_t OTG_HS_HCDMA4; // 0x194 OTG_HS host channel-4 DMA address register
    volatile uint32_t RESERVED_7[2]; // 0x198 - 0x19F
    volatile uint32_t OTG_HS_HCCHAR5; // 0x1A0 OTG_HS host channel-5 characteristics register
    volatile uint32_t OTG_HS_HCSPLT5; // 0x1A4 OTG_HS host channel-5 split control register
    volatile uint32_t OTG_HS_HCINT5; // 0x1A8 OTG_HS host channel-5 interrupt register
    volatile uint32_t OTG_HS_HCINTMSK5; // 0x1AC OTG_HS host channel-5 interrupt mask register
    volatile uint32_t OTG_HS_HCTSIZ5; // 0x1B0 OTG_HS host channel-5 transfer size register
    volatile uint32_t OTG_HS_HCDMA5; // 0x1B4 OTG_HS host channel-5 DMA address register
    volatile uint32_t RESERVED_8[2]; // 0x1B8 - 0x1BF
    volatile uint32_t OTG_HS_HCCHAR6; // 0x1C0 OTG_HS host channel-6 characteristics register
    volatile uint32_t OTG_HS_HCSPLT6; // 0x1C4 OTG_HS host channel-6 split control register
    volatile uint32_t OTG_HS_HCINT6; // 0x1C8 OTG_HS host channel-6 interrupt register
    volatile uint32_t OTG_HS_HCINTMSK6; // 0x1CC OTG_HS host channel-6 interrupt mask register
    volatile uint32_t OTG_HS_HCTSIZ6; // 0x1D0 OTG_HS host channel-6 transfer size register
    volatile uint32_t OTG_HS_HCDMA6; // 0x1D4 OTG_HS host channel-6 DMA address register
    volatile uint32_t RESERVED_9[2]; // 0x1D8 - 0x1DF
    volatile uint32_t OTG_HS_HCCHAR7; // 0x1E0 OTG_HS host channel-7 characteristics register
    volatile uint32_t OTG_HS_HCSPLT7; // 0x1E4 OTG_HS host channel-7 split control register
    volatile uint32_t OTG_HS_HCINT7; // 0x1E8 OTG_HS host channel-7 interrupt register
    volatile uint32_t OTG_HS_HCINTMSK7; // 0x1EC OTG_HS host channel-7 interrupt mask register
    volatile uint32_t OTG_HS_HCTSIZ7; // 0x1F0 OTG_HS host channel-7 transfer size register
    volatile uint32_t OTG_HS_HCDMA7; // 0x1F4 OTG_HS host channel-7 DMA address register
    volatile uint32_t RESERVED_10[2]; // 0x1F8 - 0x1FF
    volatile uint32_t OTG_HS_HCCHAR8; // 0x200 OTG_HS host channel-8 characteristics register
    volatile uint32_t OTG_HS_HCSPLT8; // 0x204 OTG_HS host channel-8 split control register
    volatile uint32_t OTG_HS_HCINT8; // 0x208 OTG_HS host channel-8 interrupt register
    volatile uint32_t OTG_HS_HCINTMSK8; // 0x20C OTG_HS host channel-8 interrupt mask register
    volatile uint32_t OTG_HS_HCTSIZ8; // 0x210 OTG_HS host channel-8 transfer size register
    volatile uint32_t OTG_HS_HCDMA8; // 0x214 OTG_HS host channel-8 DMA address register
    volatile uint32_t RESERVED_11[2]; // 0x218 - 0x21F
    volatile uint32_t OTG_HS_HCCHAR9; // 0x220 OTG_HS host channel-9 characteristics register
    volatile uint32_t OTG_HS_HCSPLT9; // 0x224 OTG_HS host channel-9 split control register
    volatile uint32_t OTG_HS_HCINT9; // 0x228 OTG_HS host channel-9 interrupt register
    volatile uint32_t OTG_HS_HCINTMSK9; // 0x22C OTG_HS host channel-9 interrupt mask register
    volatile uint32_t OTG_HS_HCTSIZ9; // 0x230 OTG_HS host channel-9 transfer size register
    volatile uint32_t OTG_HS_HCDMA9; // 0x234 OTG_HS host channel-9 DMA address register
    volatile uint32_t RESERVED_12[2]; // 0x238 - 0x23F
    volatile uint32_t OTG_HS_HCCHAR10; // 0x240 OTG_HS host channel-10 characteristics register
    volatile uint32_t OTG_HS_HCSPLT10; // 0x244 OTG_HS host channel-10 split control register
    volatile uint32_t OTG_HS_HCINT10; // 0x248 OTG_HS host channel-10 interrupt register
    volatile uint32_t OTG_HS_HCINTMSK10; // 0x24C OTG_HS host channel-10 interrupt mask register
    volatile uint32_t OTG_HS_HCTSIZ10; // 0x250 OTG_HS host channel-10 transfer size register
    volatile uint32_t OTG_HS_HCDMA10; // 0x254 OTG_HS host channel-10 DMA address register
    volatile uint32_t RESERVED_13[2]; // 0x258 - 0x25F
    volatile uint32_t OTG_HS_HCCHAR11; // 0x260 OTG_HS host channel-11 characteristics register
    volatile uint32_t OTG_HS_HCSPLT11; // 0x264 OTG_HS host channel-11 split control register
    volatile uint32_t OTG_HS_HCINT11; // 0x268 OTG_HS host channel-11 interrupt register
    volatile uint32_t OTG_HS_HCINTMSK11; // 0x26C OTG_HS host channel-11 interrupt mask register
    volatile uint32_t OTG_HS_HCTSIZ11; // 0x270 OTG_HS host channel-11 transfer size register
    volatile uint32_t OTG_HS_HCDMA11; // 0x274 OTG_HS host channel-11 DMA address register
    volatile uint32_t RESERVED_14[2]; // 0x278 - 0x27F
    volatile uint32_t OTG_HS_HCCHAR12; // 0x280 OTG_HS host channel-12 characteristics register
    volatile uint32_t OTG_HS_HCSPLT12; // 0x284 OTG_HS host channel-12 split control register
    volatile uint32_t OTG_HS_HCINT12; // 0x288 OTG_HS host channel-12 interrupt register
    volatile uint32_t OTG_HS_HCINTMSK12; // 0x28C OTG_HS host channel-12 interrupt mask register
    volatile uint32_t OTG_HS_HCTSIZ12; // 0x290 OTG_HS host channel-12 transfer size register
    volatile uint32_t OTG_HS_HCDMA12; // 0x294 OTG_HS host channel-12 DMA address register
    volatile uint32_t RESERVED_15[2]; // 0x298 - 0x29F
    volatile uint32_t OTG_HS_HCCHAR13; // 0x2A0 OTG_HS host channel-13 characteristics register
    volatile uint32_t OTG_HS_HCSPLT13; // 0x2A4 OTG_HS host channel-13 split control register
    volatile uint32_t OTG_HS_HCINT13; // 0x2A8 OTG_HS host channel-13 interrupt register
    volatile uint32_t OTG_HS_HCINTMSK13; // 0x2AC OTG_HS host channel-13 interrupt mask register
    volatile uint32_t OTG_HS_HCTSIZ13; // 0x2B0 OTG_HS host channel-13 transfer size register
    volatile uint32_t OTG_HS_HCDMA13; // 0x2B4 OTG_HS host channel-13 DMA address register
    volatile uint32_t RESERVED_16[2]; // 0x2B8 - 0x2BF
    volatile uint32_t OTG_HS_HCCHAR14; // 0x2C0 OTG_HS host channel-14 characteristics register
    volatile uint32_t OTG_HS_HCSPLT14; // 0x2C4 OTG_HS host channel-14 split control register
    volatile uint32_t OTG_HS_HCINT14; // 0x2C8 OTG_HS host channel-14 interrupt register
    volatile uint32_t OTG_HS_HCINTMSK14; // 0x2CC OTG_HS host channel-14 interrupt mask register
    volatile uint32_t OTG_HS_HCTSIZ14; // 0x2D0 OTG_HS host channel-14 transfer size register
    volatile uint32_t OTG_HS_HCDMA14; // 0x2D4 OTG_HS host channel-14 DMA address register
    volatile uint32_t RESERVED_17[2]; // 0x2D8 - 0x2DF
    volatile uint32_t OTG_HS_HCCHAR15; // 0x2E0 OTG_HS host channel-15 characteristics register
    volatile uint32_t OTG_HS_HCSPLT15; // 0x2E4 OTG_HS host channel-15 split control register
    volatile uint32_t OTG_HS_HCINT15; // 0x2E8 OTG_HS host channel-15 interrupt register
    volatile uint32_t OTG_HS_HCINTMSK15; // 0x2EC OTG_HS host channel-15 interrupt mask register
    volatile uint32_t OTG_HS_HCTSIZ15; // 0x2F0 OTG_HS host channel-15 transfer size register
    volatile uint32_t OTG_HS_HCDMA15; // 0x2F4 OTG_HS host channel-15 DMA address register
} OTG_HS_HOST_TypeDef;

#define OTG_HS_HOST   ((OTG_HS_HOST_TypeDef *) 0x40040400UL)

