jbvalle/kx_regs/stm32f429zi_regs.h
typedef struct {
    volatile uint32_t OTG_HS_DCFG ; // 0x00 OTG_HS device configuration register
    volatile uint32_t OTG_HS_DCTL ; // 0x04 OTG_HS device control register
    volatile uint32_t OTG_HS_DSTS ; // 0x08 OTG_HS device status register
    volatile uint32_t RESERVED_0[1]; // 0x0C - 0x0F
    volatile uint32_t OTG_HS_DIEPMSK; // 0x10 OTG_HS device IN endpoint common interrupt mask register
    volatile uint32_t OTG_HS_DOEPMSK; // 0x14 OTG_HS device OUT endpoint common interrupt mask register
    volatile uint32_t OTG_HS_DAINT; // 0x18 OTG_HS device all endpoints interrupt register
    volatile uint32_t OTG_HS_DAINTMSK; // 0x1C OTG_HS all endpoints interrupt mask register
    volatile uint32_t RESERVED_1[2]; // 0x20 - 0x27
    volatile uint32_t OTG_HS_DVBUSDIS; // 0x28 OTG_HS device VBUS discharge time register
    volatile uint32_t OTG_HS_DVBUSPULSE; // 0x2C OTG_HS device VBUS pulsing time register
    volatile uint32_t OTG_HS_DTHRCTL; // 0x30 OTG_HS Device threshold control register
    volatile uint32_t OTG_HS_DIEPEMPMSK; // 0x34 OTG_HS device IN endpoint FIFO empty interrupt mask register
    volatile uint32_t OTG_HS_DEACHINT; // 0x38 OTG_HS device each endpoint interrupt register
    volatile uint32_t OTG_HS_DEACHINTMSK; // 0x3C OTG_HS device each endpoint interrupt register mask
    volatile uint32_t RESERVED_2[1]; // 0x40 - 0x43
    volatile uint32_t OTG_HS_DIEPEACHMSK1; // 0x44 OTG_HS device each in endpoint-1 interrupt register
    volatile uint32_t RESERVED_3[15]; // 0x48 - 0x83
    volatile uint32_t OTG_HS_DOEPEACHMSK1; // 0x84 OTG_HS device each OUT endpoint-1 interrupt register
    volatile uint32_t RESERVED_4[30]; // 0x88 - 0xFF
    volatile uint32_t OTG_HS_DIEPCTL0; // 0x100 OTG device endpoint-0 control register
    volatile uint32_t RESERVED_5[1]; // 0x104 - 0x107
    volatile uint32_t OTG_HS_DIEPINT0; // 0x108 OTG device endpoint-0 interrupt register
    volatile uint32_t RESERVED_6[1]; // 0x10C - 0x10F
    volatile uint32_t OTG_HS_DIEPTSIZ0; // 0x110 OTG_HS device IN endpoint 0 transfer size register
    volatile uint32_t OTG_HS_DIEPDMA1; // 0x114 OTG_HS device endpoint-1 DMA address register
    volatile uint32_t OTG_HS_DTXFSTS0; // 0x118 OTG_HS device IN endpoint transmit FIFO status register
    volatile uint32_t RESERVED_7[1]; // 0x11C - 0x11F
    volatile uint32_t OTG_HS_DIEPCTL1; // 0x120 OTG device endpoint-1 control register
    volatile uint32_t RESERVED_8[1]; // 0x124 - 0x127
    volatile uint32_t OTG_HS_DIEPINT1; // 0x128 OTG device endpoint-1 interrupt register
    volatile uint32_t RESERVED_9[1]; // 0x12C - 0x12F
    volatile uint32_t OTG_HS_DIEPTSIZ1; // 0x130 OTG_HS device endpoint transfer size register
    volatile uint32_t OTG_HS_DIEPDMA2; // 0x134 OTG_HS device endpoint-2 DMA address register
    volatile uint32_t OTG_HS_DTXFSTS1; // 0x138 OTG_HS device IN endpoint transmit FIFO status register
    volatile uint32_t RESERVED_10[1]; // 0x13C - 0x13F
    volatile uint32_t OTG_HS_DIEPCTL2; // 0x140 OTG device endpoint-2 control register
    volatile uint32_t RESERVED_11[1]; // 0x144 - 0x147
    volatile uint32_t OTG_HS_DIEPINT2; // 0x148 OTG device endpoint-2 interrupt register
    volatile uint32_t RESERVED_12[1]; // 0x14C - 0x14F
    volatile uint32_t OTG_HS_DIEPTSIZ2; // 0x150 OTG_HS device endpoint transfer size register
    volatile uint32_t OTG_HS_DIEPDMA3; // 0x154 OTG_HS device endpoint-3 DMA address register
    volatile uint32_t OTG_HS_DTXFSTS2; // 0x158 OTG_HS device IN endpoint transmit FIFO status register
    volatile uint32_t RESERVED_13[1]; // 0x15C - 0x15F
    volatile uint32_t OTG_HS_DIEPCTL3; // 0x160 OTG device endpoint-3 control register
    volatile uint32_t RESERVED_14[1]; // 0x164 - 0x167
    volatile uint32_t OTG_HS_DIEPINT3; // 0x168 OTG device endpoint-3 interrupt register
    volatile uint32_t RESERVED_15[1]; // 0x16C - 0x16F
    volatile uint32_t OTG_HS_DIEPTSIZ3; // 0x170 OTG_HS device endpoint transfer size register
    volatile uint32_t OTG_HS_DIEPDMA4; // 0x174 OTG_HS device endpoint-4 DMA address register
    volatile uint32_t OTG_HS_DTXFSTS3; // 0x178 OTG_HS device IN endpoint transmit FIFO status register
    volatile uint32_t RESERVED_16[1]; // 0x17C - 0x17F
    volatile uint32_t OTG_HS_DIEPCTL4; // 0x180 OTG device endpoint-4 control register
    volatile uint32_t RESERVED_17[1]; // 0x184 - 0x187
    volatile uint32_t OTG_HS_DIEPINT4; // 0x188 OTG device endpoint-4 interrupt register
    volatile uint32_t RESERVED_18[1]; // 0x18C - 0x18F
    volatile uint32_t OTG_HS_DIEPTSIZ4; // 0x190 OTG_HS device endpoint transfer size register
    volatile uint32_t OTG_HS_DIEPDMA5; // 0x194 OTG_HS device endpoint-5 DMA address register
    volatile uint32_t OTG_HS_DTXFSTS4; // 0x198 OTG_HS device IN endpoint transmit FIFO status register
    volatile uint32_t RESERVED_19[1]; // 0x19C - 0x19F
    volatile uint32_t OTG_HS_DIEPCTL5; // 0x1A0 OTG device endpoint-5 control register
    volatile uint32_t RESERVED_20[1]; // 0x1A4 - 0x1A7
    volatile uint32_t OTG_HS_DIEPINT5; // 0x1A8 OTG device endpoint-5 interrupt register
    volatile uint32_t RESERVED_21[1]; // 0x1AC - 0x1AF
    volatile uint32_t OTG_HS_DIEPTSIZ5; // 0x1B0 OTG_HS device endpoint transfer size register
    volatile uint32_t RESERVED_22[1]; // 0x1B4 - 0x1B7
    volatile uint32_t OTG_HS_DTXFSTS5; // 0x1B8 OTG_HS device IN endpoint transmit FIFO status register
    volatile uint32_t RESERVED_23[1]; // 0x1BC - 0x1BF
    volatile uint32_t OTG_HS_DIEPCTL6; // 0x1C0 OTG device endpoint-6 control register
    volatile uint32_t RESERVED_24[1]; // 0x1C4 - 0x1C7
    volatile uint32_t OTG_HS_DIEPINT6; // 0x1C8 OTG device endpoint-6 interrupt register
    volatile uint32_t RESERVED_25[5]; // 0x1CC - 0x1DF
    volatile uint32_t OTG_HS_DIEPCTL7; // 0x1E0 OTG device endpoint-7 control register
    volatile uint32_t RESERVED_26[1]; // 0x1E4 - 0x1E7
    volatile uint32_t OTG_HS_DIEPINT7; // 0x1E8 OTG device endpoint-7 interrupt register
    volatile uint32_t RESERVED_27[69]; // 0x1EC - 0x2FF
    volatile uint32_t OTG_HS_DOEPCTL0; // 0x300 OTG_HS device control OUT endpoint 0 control register
    volatile uint32_t RESERVED_28[1]; // 0x304 - 0x307
    volatile uint32_t OTG_HS_DOEPINT0; // 0x308 OTG_HS device endpoint-0 interrupt register
    volatile uint32_t RESERVED_29[1]; // 0x30C - 0x30F
    volatile uint32_t OTG_HS_DOEPTSIZ0; // 0x310 OTG_HS device endpoint-1 transfer size register
    volatile uint32_t RESERVED_30[3]; // 0x314 - 0x31F
    volatile uint32_t OTG_HS_DOEPCTL1; // 0x320 OTG device endpoint-1 control register
    volatile uint32_t RESERVED_31[1]; // 0x324 - 0x327
    volatile uint32_t OTG_HS_DOEPINT1; // 0x328 OTG_HS device endpoint-1 interrupt register
    volatile uint32_t RESERVED_32[1]; // 0x32C - 0x32F
    volatile uint32_t OTG_HS_DOEPTSIZ1; // 0x330 OTG_HS device endpoint-2 transfer size register
    volatile uint32_t RESERVED_33[3]; // 0x334 - 0x33F
    volatile uint32_t OTG_HS_DOEPCTL2; // 0x340 OTG device endpoint-2 control register
    volatile uint32_t RESERVED_34[1]; // 0x344 - 0x347
    volatile uint32_t OTG_HS_DOEPINT2; // 0x348 OTG_HS device endpoint-2 interrupt register
    volatile uint32_t RESERVED_35[1]; // 0x34C - 0x34F
    volatile uint32_t OTG_HS_DOEPTSIZ2; // 0x350 OTG_HS device endpoint-3 transfer size register
    volatile uint32_t RESERVED_36[3]; // 0x354 - 0x35F
    volatile uint32_t OTG_HS_DOEPCTL3; // 0x360 OTG device endpoint-3 control register
    volatile uint32_t RESERVED_37[1]; // 0x364 - 0x367
    volatile uint32_t OTG_HS_DOEPINT3; // 0x368 OTG_HS device endpoint-3 interrupt register
    volatile uint32_t RESERVED_38[1]; // 0x36C - 0x36F
    volatile uint32_t OTG_HS_DOEPTSIZ3; // 0x370 OTG_HS device endpoint-4 transfer size register
    volatile uint32_t RESERVED_39[5]; // 0x374 - 0x387
    volatile uint32_t OTG_HS_DOEPINT4; // 0x388 OTG_HS device endpoint-4 interrupt register
    volatile uint32_t RESERVED_40[1]; // 0x38C - 0x38F
    volatile uint32_t OTG_HS_DOEPTSIZ4; // 0x390 OTG_HS device endpoint-5 transfer size register
    volatile uint32_t RESERVED_41[5]; // 0x394 - 0x3A7
    volatile uint32_t OTG_HS_DOEPINT5; // 0x3A8 OTG_HS device endpoint-5 interrupt register
    volatile uint32_t RESERVED_42[7]; // 0x3AC - 0x3C7
    volatile uint32_t OTG_HS_DOEPINT6; // 0x3C8 OTG_HS device endpoint-6 interrupt register
    volatile uint32_t RESERVED_43[7]; // 0x3CC - 0x3E7
    volatile uint32_t OTG_HS_DOEPINT7; // 0x3E8 OTG_HS device endpoint-7 interrupt register
} OTG_HS_DEVICE_TypeDef;

#define OTG_HS_DEVICE   ((OTG_HS_DEVICE_TypeDef *) 0x40040800UL)

