jbvalle/kx_regs/stm32f429zi_regs.h
typedef struct {
    volatile uint32_t OTG_HS_PCGCR; // 0x00 Power and clock gating control register
} OTG_HS_PWRCLK_TypeDef;

#define OTG_HS_PWRCLK   ((OTG_HS_PWRCLK_TypeDef *) 0x40040E00UL)

typedef struct {
    volatile uint32_t RESERVED_0[2]; // 0x00 - 0x07
    volatile uint32_t SSCR        ; // 0x08 Synchronization Size Configuration Register
    volatile uint32_t BPCR        ; // 0x0C Back Porch Configuration Register
    volatile uint32_t AWCR        ; // 0x10 Active Width Configuration Register
    volatile uint32_t TWCR        ; // 0x14 Total Width Configuration Register
    volatile uint32_t GCR         ; // 0x18 Global Control Register
    volatile uint32_t RESERVED_1[2]; // 0x1C - 0x23
    volatile uint32_t SRCR        ; // 0x24 Shadow Reload Configuration Register
    volatile uint32_t RESERVED_2[1]; // 0x28 - 0x2B
    volatile uint32_t BCCR        ; // 0x2C Background Color Configuration Register
    volatile uint32_t RESERVED_3[1]; // 0x30 - 0x33
    volatile uint32_t IER         ; // 0x34 Interrupt Enable Register
    volatile uint32_t ISR         ; // 0x38 Interrupt Status Register
    volatile uint32_t ICR         ; // 0x3C Interrupt Clear Register
    volatile uint32_t LIPCR       ; // 0x40 Line Interrupt Position Configuration Register
    volatile uint32_t CPSR        ; // 0x44 Current Position Status Register
    volatile uint32_t CDSR        ; // 0x48 Current Display Status Register
    volatile uint32_t RESERVED_4[14]; // 0x4C - 0x83
    volatile uint32_t L1CR        ; // 0x84 LayerControl Register
    volatile uint32_t L1WHPCR     ; // 0x88 LayerWindow Horizontal Position Configuration Register
    volatile uint32_t L1WVPCR     ; // 0x8C LayerWindow Vertical Position Configuration Register
    volatile uint32_t L1CKCR      ; // 0x90 LayerColor Keying Configuration Register
    volatile uint32_t L1PFCR      ; // 0x94 LayerPixel Format Configuration Register
    volatile uint32_t L1CACR      ; // 0x98 LayerConstant Alpha Configuration Register
    volatile uint32_t L1DCCR      ; // 0x9C LayerDefault Color Configuration Register
    volatile uint32_t L1BFCR      ; // 0xA0 LayerBlending Factors Configuration Register
    volatile uint32_t RESERVED_5[2]; // 0xA4 - 0xAB
    volatile uint32_t L1CFBAR     ; // 0xAC LayerColor Frame Buffer Address Register
    volatile uint32_t L1CFBLR     ; // 0xB0 LayerColor Frame Buffer Length Register
    volatile uint32_t L1CFBLNR    ; // 0xB4 LayerColorFrame Buffer Line Number Register
    volatile uint32_t RESERVED_6[3]; // 0xB8 - 0xC3
    volatile uint32_t L1CLUTWR    ; // 0xC4 LayerCLUT Write Register
    volatile uint32_t RESERVED_7[15]; // 0xC8 - 0x103
    volatile uint32_t L2CR        ; // 0x104 LayerControl Register
    volatile uint32_t L2WHPCR     ; // 0x108 LayerWindow Horizontal Position Configuration Register
    volatile uint32_t L2WVPCR     ; // 0x10C LayerWindow Vertical Position Configuration Register
    volatile uint32_t L2CKCR      ; // 0x110 LayerColor Keying Configuration Register
    volatile uint32_t L2PFCR      ; // 0x114 LayerPixel Format Configuration Register
    volatile uint32_t L2CACR      ; // 0x118 LayerConstant Alpha Configuration Register
    volatile uint32_t L2DCCR      ; // 0x11C LayerDefault Color Configuration Register
    volatile uint32_t L2BFCR      ; // 0x120 LayerBlending Factors Configuration Register
    volatile uint32_t RESERVED_8[2]; // 0x124 - 0x12B
    volatile uint32_t L2CFBAR     ; // 0x12C LayerColor Frame Buffer Address Register
    volatile uint32_t L2CFBLR     ; // 0x130 LayerColor Frame Buffer Length Register
    volatile uint32_t L2CFBLNR    ; // 0x134 LayerColorFrame Buffer Line Number Register
    volatile uint32_t RESERVED_9[3]; // 0x138 - 0x143
    volatile uint32_t L2CLUTWR    ; // 0x144 LayerCLUT Write Register
} LTDC_TypeDef;

#define LTDC   ((LTDC_TypeDef *) 0x40016800UL)

typedef struct {
    volatile uint32_t RESERVED_0[1]; // 0x00 - 0x03
    volatile uint32_t ACR1        ; // 0x04 AConfiguration register 1
    volatile uint32_t ACR2        ; // 0x08 AConfiguration register 2
    volatile uint32_t AFRCR       ; // 0x0C AFRCR
    volatile uint32_t ASLOTR      ; // 0x10 ASlot register
    volatile uint32_t AIM         ; // 0x14 AInterrupt mask register2
    volatile uint32_t ASR         ; // 0x18 AStatus register
    volatile uint32_t ACLRFR      ; // 0x1C AClear flag register
    volatile uint32_t ADR         ; // 0x20 AData register
    volatile uint32_t BCR1        ; // 0x24 BConfiguration register 1
    volatile uint32_t BCR2        ; // 0x28 BConfiguration register 2
    volatile uint32_t BFRCR       ; // 0x2C BFRCR
    volatile uint32_t BSLOTR      ; // 0x30 BSlot register
    volatile uint32_t BIM         ; // 0x34 BInterrupt mask register2
    volatile uint32_t BSR         ; // 0x38 BStatus register
    volatile uint32_t BCLRFR      ; // 0x3C BClear flag register
    volatile uint32_t BDR         ; // 0x40 BData register
} SAI_TypeDef;

#define SAI   ((SAI_TypeDef *) 0x40015800UL)

typedef struct {
    volatile uint32_t CR          ; // 0x00 control register
    volatile uint32_t ISR         ; // 0x04 Interrupt Status Register
    volatile uint32_t IFCR        ; // 0x08 interrupt flag clear register
    volatile uint32_t FGMAR       ; // 0x0C foreground memory address register
    volatile uint32_t FGOR        ; // 0x10 foreground offset register
    volatile uint32_t BGMAR       ; // 0x14 background memory address register
    volatile uint32_t BGOR        ; // 0x18 background offset register
    volatile uint32_t FGPFCCR     ; // 0x1C foreground PFC control register
    volatile uint32_t FGCOLR      ; // 0x20 foreground color register
    volatile uint32_t BGPFCCR     ; // 0x24 background PFC control register
    volatile uint32_t BGCOLR      ; // 0x28 background color register
    volatile uint32_t FGCMAR      ; // 0x2C foreground CLUT memory address register
    volatile uint32_t BGCMAR      ; // 0x30 background CLUT memory address register
    volatile uint32_t OPFCCR      ; // 0x34 output PFC control register
    volatile uint32_t OCOLR       ; // 0x38 output color register
    volatile uint32_t OMAR        ; // 0x3C output memory address register
    volatile uint32_t OOR         ; // 0x40 output offset register
    volatile uint32_t NLR         ; // 0x44 number of line register
    volatile uint32_t LWR         ; // 0x48 line watermark register
    volatile uint32_t AMTCR       ; // 0x4C AHB master timer configuration register
    volatile uint32_t RESERVED_0[236]; // 0x50 - 0x3FF
    volatile uint32_t FGCLUT      ; // 0x400 FGCLUT
    volatile uint32_t RESERVED_1[255]; // 0x404 - 0x7FF
    volatile uint32_t BGCLUT      ; // 0x800 BGCLUT
} DMA2D_TypeDef;

#define DMA2D   ((DMA2D_TypeDef *) 0x4002B000UL)

typedef struct {
    volatile uint32_t CR1         ; // 0x00 Control register 1
    volatile uint32_t CR2         ; // 0x04 Control register 2
    volatile uint32_t OAR1        ; // 0x08 Own address register 1
    volatile uint32_t OAR2        ; // 0x0C Own address register 2
    volatile uint32_t DR          ; // 0x10 Data register
    volatile uint32_t SR1         ; // 0x14 Status register 1
    volatile uint32_t SR2         ; // 0x18 Status register 2
    volatile uint32_t CCR         ; // 0x1C Clock control register
    volatile uint32_t TRISE       ; // 0x20 TRISE register
    volatile uint32_t FLTR        ; // 0x24 I2C FLTR register
} I2C3_TypeDef;

#define I2C3   ((I2C3_TypeDef *) 0x40005C00UL)

#endif /* STM32F429_H */
